2024.01.23.org
#+OPTIONS: ^:nil
#+OPTIONS: html-postamble:nil
#+OPTIONS: num:nil
#+OPTIONS: toc:nil
#+OPTIONS: author:nil
#+HTML_HEAD: <style type="text/css">#table-of-contents h2 { display: none } .title { display: none } .authorname { text-align: right }</style>
#+HTML_HEAD: <style type="text/css">.outline-2 {border-top: 1px solid black;}</style>
#+TITLE: OCaml Weekly News
[[https://alan.petitepomme.net/cwn/2024.01.16.html][Previous Week]] [[https://alan.petitepomme.net/cwn/index.html][Up]] [[https://alan.petitepomme.net/cwn/2024.01.30.html][Next Week]]

Hello

Here is the latest OCaml Weekly News, for the week of January 16 to 23, 2024.

#+TOC: headlines 1


* The OCaml community is signed up for Outreachy!
:PROPERTIES:
:CUSTOM_ID: 1
:END:
Archive: https://discuss.ocaml.org/t/the-ocaml-community-is-signed-up-for-outreachy/13892/1

** Sonja Heinze announced


Hello everyone :wave:

Very good news: The OCaml community is signed up for the next Outreachy round with four slots again!

[[https://www.outreachy.org/][Outreachy]] is a non-profit providing an over-arching structure for open-source
communities to offer three months long remote internships to folks from underrepresented backgrounds in
open-source. Participating in Outreachy is a great opportunity for any open-source community to work with new
people, to increase its outreach, and to open a first door to more diversity in the community.

The [[https://ocaml.org/outreachy][OCaml community has a long history]] of participating in that wonderful
initiative. There have been all kinds of OCaml projects that interns have worked on, shaped, and given input to
every year since 2014 (with the exception of 2017/18). And also this (Northern hemisphere) winter, [[https://discuss.ocaml.org/t/welcoming-our-new-outrechy-interns/13652][we're having
three amazing interns with us]].

So, as a first point, I want to say: Thank you, everyone! :heart: I myself have started being involved in the OCaml
Outreachy organization only recently, while the whole community has been driving this for a long time now. And
that's one of the many things that's really really nice about OCaml: There are nice industrial users, in this case
[[https://www.janestreet.com/][Jane Street]] and [[https://tarides.com/][Tarides]], who're willing to fund these kinds
of efforts, and there's a whole lot of community members who're willing to (and enjoy!) getting involved, come up
with projects, and mentor.

And that brings me to my second point: Do reach out to us if you also want to form part of this. It's up to you
whether you want to write in this thread or to DM @patricoferris and/or me (@pitag). Just like in the last couple
of rounds, I already have a few concrete people in mind to reach out to for the upcoming round. However, I don't
know and can't know everyone in the community in person. So me reaching out to people is working well so far, but
people reaching out to us would be much easier and a lot less restrictive.

PD: I'll post here with the relevant dates for the next round once they become more relevant. To already give one
date: The deadline for OCaml community members to submit internship projects is **Feb. 23, 2024**.
      



* OCaml.org Newsletter: November and December 2023
:PROPERTIES:
:CUSTOM_ID: 2
:END:
Archive: https://discuss.ocaml.org/t/ocaml-org-newsletter-november-and-december-2023/13895/1

