2024.01.23.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-01-23 Tue 10:43 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>OCaml Weekly News</title>
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">OCaml Weekly News</h1>
<p>
<a href="https://alan.petitepomme.net/cwn/2024.01.16.html">Previous Week</a> <a href="https://alan.petitepomme.net/cwn/index.html">Up</a> <a href="https://alan.petitepomme.net/cwn/2024.01.30.html">Next Week</a>
</p>

<p>
Hello
</p>

<p>
Here is the latest OCaml Weekly News, for the week of January 16 to 23, 2024.
</p>

<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#1">The OCaml community is signed up for Outreachy!</a></li>
<li><a href="#2">OCaml.org Newsletter: November and December 2023</a></li>
<li><a href="#3">Discussions on the future of the opam repository</a></li>
<li><a href="#4">dune 3.13</a></li>
<li><a href="#5">opam 2.2.0~beta1</a></li>
<li><a href="#6">Zipc 0.1.0</a></li>
<li><a href="#7">Other OCaml News</a></li>
<li><a href="#orgee89ca0">Old CWN</a></li>
</ul>
</div>
</div>
<div id="outline-container-1" class="outline-2">
<h2 id="1">The OCaml community is signed up for Outreachy!</h2>
<div class="outline-text-2" id="text-1">
<p>
Archive: <a href="https://discuss.ocaml.org/t/the-ocaml-community-is-signed-up-for-outreachy/13892/1">https://discuss.ocaml.org/t/the-ocaml-community-is-signed-up-for-outreachy/13892/1</a>
</p>
</div>
<div id="outline-container-orgf087895" class="outline-3">
<h3 id="orgf087895">Sonja Heinze announced</h3>
<div class="outline-text-3" id="text-orgf087895">
<p>
Hello everyone :wave:
</p>

<p>
Very good news: The OCaml community is signed up for the next Outreachy round with four slots again!
</p>

<p>
<a href="https://www.outreachy.org/">Outreachy</a> is a non-profit providing an over-arching structure for open-source
communities to offer three months long remote internships to folks from underrepresented backgrounds in
open-source. Participating in Outreachy is a great opportunity for any open-source community to work with new
people, to increase its outreach, and to open a first door to more diversity in the community.
</p>

<p>
The <a href="https://ocaml.org/outreachy">OCaml community has a long history</a> of participating in that wonderful
initiative. There have been all kinds of OCaml projects that interns have worked on, shaped, and given input to
every year since 2014 (with the exception of 2017/18). And also this (Northern hemisphere) winter, <a href="https://discuss.ocaml.org/t/welcoming-our-new-outrechy-interns/13652">we&rsquo;re having
three amazing interns with us</a>.
</p>

<p>
So, as a first point, I want to say: Thank you, everyone! :heart: I myself have started being involved in the OCaml
Outreachy organization only recently, while the whole community has been driving this for a long time now. And
that&rsquo;s one of the many things that&rsquo;s really really nice about OCaml: There are nice industrial users, in this case
<a href="https://www.janestreet.com/">Jane Street</a> and <a href="https://tarides.com/">Tarides</a>, who&rsquo;re willing to fund these kinds
of efforts, and there&rsquo;s a whole lot of community members who&rsquo;re willing to (and enjoy!) getting involved, come up
with projects, and mentor.
</p>

<p>
And that brings me to my second point: Do reach out to us if you also want to form part of this. It&rsquo;s up to you
whether you want to write in this thread or to DM @patricoferris and/or me (@pitag). Just like in the last couple
of rounds, I already have a few concrete people in mind to reach out to for the upcoming round. However, I don&rsquo;t
know and can&rsquo;t know everyone in the community in person. So me reaching out to people is working well so far, but
people reaching out to us would be much easier and a lot less restrictive.
</p>

<p>
PD: I&rsquo;ll post here with the relevant dates for the next round once they become more relevant. To already give one
date: The deadline for OCaml community members to submit internship projects is <b><b>Feb. 23, 2024</b></b>.
</p>
</div>
</div>
</div>
<div id="outline-container-2" class="outline-2">
<h2 id="2">OCaml.org Newsletter: November and December 2023</h2>
<div class="outline-text-2" id="text-2">
<p>
Archive: <a href="https://discuss.ocaml.org/t/ocaml-org-newsletter-november-and-december-2023/13895/1">https://discuss.ocaml.org/t/ocaml-org-newsletter-november-and-december-2023/13895/1</a>
</p>
</div>
