2024.01.23.txt
                          ━━━━━━━━━━━━━━━━━━━
                           OCAML WEEKLY NEWS
                          ━━━━━━━━━━━━━━━━━━━


[Previous Week] [Up] [Next Week]

Hello

Here is the latest OCaml Weekly News, for the week of January 16 to 23,
2024.

Table of Contents
─────────────────

The OCaml community is signed up for Outreachy!
OCaml.org Newsletter: November and December 2023
Discussions on the future of the opam repository
dune 3.13
opam 2.2.0~beta1
Zipc 0.1.0
Other OCaml News
Old CWN


[Previous Week] <https://alan.petitepomme.net/cwn/2024.01.16.html>

[Up] <https://alan.petitepomme.net/cwn/index.html>

[Next Week] <https://alan.petitepomme.net/cwn/2024.01.30.html>


The OCaml community is signed up for Outreachy!
═══════════════════════════════════════════════

  Archive:
  <https://discuss.ocaml.org/t/the-ocaml-community-is-signed-up-for-outreachy/13892/1>


Sonja Heinze announced
──────────────────────

  Hello everyone :wave:

  Very good news: The OCaml community is signed up for the next
  Outreachy round with four slots again!

  [Outreachy] is a non-profit providing an over-arching structure for
  open-source communities to offer three months long remote internships
  to folks from underrepresented backgrounds in open-source.
  Participating in Outreachy is a great opportunity for any open-source
  community to work with new people, to increase its outreach, and to
  open a first door to more diversity in the community.

  The [OCaml community has a long history] of participating in that
  wonderful initiative. There have been all kinds of OCaml projects that
  interns have worked on, shaped, and given input to every year since
  2014 (with the exception of 2017/18). And also this (Northern
  hemisphere) winter, [we’re having three amazing interns with us].

  So, as a first point, I want to say: Thank you, everyone! :heart: I
  myself have started being involved in the OCaml Outreachy organization
  only recently, while the whole community has been driving this for a
  long time now. And that’s one of the many things that’s really really
  nice about OCaml: There are nice industrial users, in this case [Jane
  Street] and [Tarides], who’re willing to fund these kinds of efforts,
  and there’s a whole lot of community members who’re willing to (and
  enjoy!) getting involved, come up with projects, and mentor.

  And that brings me to my second point: Do reach out to us if you also
  want to form part of this. It’s up to you whether you want to write in
  this thread or to DM @patricoferris and/or me (@pitag). Just like in
  the last couple of rounds, I already have a few concrete people in
  mind to reach out to for the upcoming round. However, I don’t know and
  can’t know everyone in the community in person. So me reaching out to
  people is working well so far, but people reaching out to us would be
  much easier and a lot less restrictive.

  PD: I’ll post here with the relevant dates for the next round once
  they become more relevant. To already give one date: The deadline for
  OCaml community members to submit internship projects is **Feb. 23,
  2024**.


[Outreachy] <https://www.outreachy.org/>

[OCaml community has a long history] <https://ocaml.org/outreachy>

[we’re having three amazing interns with us]
<https://discuss.ocaml.org/t/welcoming-our-new-outrechy-interns/13652>

[Jane Street] <https://www.janestreet.com/>

[Tarides] <https://tarides.com/>


OCaml.org Newsletter: November and December 2023
════════════════════════════════════════════════

  Archive:
  <https://discuss.ocaml.org/t/ocaml-org-newsletter-november-and-december-2023/13895/1>
