2024.01.23.html
<div id="outline-container-orgb297312" class="outline-3">
<h3 id="orgb297312">Sabine Schmaltz announced</h3>
<div class="outline-text-3" id="text-orgb297312">
<p>
Welcome to the November and December 2023 edition of the OCaml.org newsletter! This update has been compiled by the
OCaml.org team. You can find <a href="https://discuss.ocaml.org/tag/ocamlorg-newsletter">previous updates</a> on Discuss.
</p>

<p>
Our goal is to make OCaml.org the best resource for anyone who wants to get started and be productive in OCaml. The
OCaml.org newsletter provides an update on our progress towards that goal and an overview of the changes we are
working on.
</p>

<p>
We couldn&rsquo;t do it without all the amazing OCaml community members who help us review, revise, and create better
OCaml documentation. Your feedback enables us to better prioritise our work and make progress towards our goal.
Thank you!
</p>

<p>
This newsletter covers:
</p>
<ul class="org-ul">
<li><b>Learn Area:</b> We made substantial changes to the Learn Area UI, introducing a new landing page and improving various elements on the Learn Area&rsquo;s subpages. Work on a documentation search feature is in progress, and new documentation has been added or substantially improved!</li>
<li><b>Upcoming Dark Mode</b>: We completed the UI designs for the upcoming dark mode and our Outreachy intern has</li>
</ul>
<p>
started to implement the changes.
</p>
<ul class="org-ul">
<li><b>Announcing the Outreachy Interns</b>: We&rsquo;re happy to welcome two interns to work on OCaml projects!</li>
<li><b>General Improvements:</b> As usual, we also worked on general maintenance and improvements based on user feedback, so we&rsquo;re highlighting some of our work below.</li>
</ul>
</div>
<div id="outline-container-orgab6749b" class="outline-4">
<h4 id="orgab6749b">Open Issues for Contributors</h4>
<div class="outline-text-4" id="text-orgab6749b">
<p>
We created many issues for external contributors. The majority of them are suitable for OCaml beginners, and we&rsquo;re
happy to review and provide feedback on your pull requests!
</p>

<p>
You can find <a href="https://github.com/ocaml/ocaml.org/issues?q=is%3Aissue+is%3Aopen+label%3A%22help+wanted%22+no%3Aassignee">open issues for contributors
here</a>!
</p>
</div>
</div>
<div id="outline-container-org6f69259" class="outline-4">
<h4 id="org6f69259">Learn Area</h4>
<div class="outline-text-4" id="text-org6f69259">
</div>
<ul class="org-ul">
<li><a id="org0189682"></a>1. Redesign of the Learn Area<br />
<div class="outline-text-5" id="text-org0189682">
<p>
OCaml.org is undergoing an exciting transformation, and we&rsquo;re thrilled to share some key updates with you. Our main
focus has been the finalisation and approval of a new user interface (UI) design, aimed at enhancing your
experience. This update isn&rsquo;t just about looks; we&rsquo;re ensuring the website is fully optimised for mobile and tablet
devices.
</p>

<p>
The collaboration between our team and users like you has been instrumental in shaping the project. Your input and
support have been invaluable, and we&rsquo;re grateful for the community&rsquo;s involvement in making this website the best it
can be.
</p>

<p>
Our design system has seen several updates, including new components like a variable landing page button, diverse
icons (including social media and OCaml icons like Dune and opam), enhanced text styles, updated color variables,
and more.
</p>

<p>
We&rsquo;ve completed the designs for all pages of the Learn area. Each page has been designed with attention to detail,
ensuring consistency and coherence across all versions.
</p>

<p>
If you’re curious and want to take a closer look at the designs, you can access our <a href="https://www.figma.com/file/6BSOEqSsyQeulwLo2pjs9r/Untitled?type=design&amp;node-id=0%3A1&amp;mode=design&amp;t=GwVxvrXItX7k8pP9-1">Figma Design
Files</a>.
Please be aware that the content shown on the pages is not always accurate. We aim to provide our designer with
better content for the mockups and UI going forward.
</p>

<p>
The work on implementing the new designs for the light mode of the Learn area have been completed in December!
</p>

<p>
<b>Relevant PRs and Activities:</b>
</p>
<ul class="org-ul">
<li>Implemented Learn UI from Figma <a href="https://github.com/ocaml/ocaml.org/pull/1798">ocaml/ocaml.org#1798</a></li>
<li><a href="https://github/com/FatumaA">@FatumaA</a> contributed: Improve platform page card styles <a href="https://github.com/ocaml/ocaml.org/pull/1752">ocaml/ocaml.org#1752</a></li>
<li><a href="https://github.com/florentdrousset">@florentdrousset</a> contributed: Link exercises to tutorials <a href="https://github.com/ocaml/ocaml.org/pull/1753">ocaml/ocaml.org#1753</a></li>
<li>Add book links based on Figma design - <a href="https://github.com/ocaml/ocaml.org/pull/1834">ocaml/ocaml.org#1834</a></li>
<li>WIP: Documentation Search Feature - <a href="https://github.com/ocaml/ocaml.org/pull/1871">ocaml/ocaml.org#1871</a></li>
</ul>
</div>
</li>
