2024.01.23.txt


Sabine Schmaltz announced
─────────────────────────

  Welcome to the November and December 2023 edition of the OCaml.org
  newsletter! This update has been compiled by the OCaml.org team. You
  can find [previous updates] on Discuss.

  Our goal is to make OCaml.org the best resource for anyone who wants
  to get started and be productive in OCaml. The OCaml.org newsletter
  provides an update on our progress towards that goal and an overview
  of the changes we are working on.

  We couldn’t do it without all the amazing OCaml community members who
  help us review, revise, and create better OCaml documentation. Your
  feedback enables us to better prioritise our work and make progress
  towards our goal. Thank you!

  This newsletter covers:
  • *Learn Area:* We made substantial changes to the Learn Area UI,
     introducing a new landing page and improving various elements on
     the Learn Area’s subpages. Work on a documentation search feature
     is in progress, and new documentation has been added or
     substantially improved!
  • *Upcoming Dark Mode*: We completed the UI designs for the upcoming
     dark mode and our Outreachy intern has
  started to implement the changes.
  • *Announcing the Outreachy Interns*: We’re happy to welcome two
     interns to work on OCaml projects!
  • *General Improvements:* As usual, we also worked on general
     maintenance and improvements based on user feedback, so we’re
     highlighting some of our work below.


[previous updates] <https://discuss.ocaml.org/tag/ocamlorg-newsletter>

Open Issues for Contributors
╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌

  We created many issues for external contributors. The majority of them
  are suitable for OCaml beginners, and we’re happy to review and
  provide feedback on your pull requests!

  You can find [open issues for contributors here]!


[open issues for contributors here]
<https://github.com/ocaml/ocaml.org/issues?q=is%3Aissue+is%3Aopen+label%3A%22help+wanted%22+no%3Aassignee>


Learn Area
╌╌╌╌╌╌╌╌╌╌

◊ 1. Redesign of the Learn Area

  OCaml.org is undergoing an exciting transformation, and we’re thrilled
  to share some key updates with you. Our main focus has been the
  finalisation and approval of a new user interface (UI) design, aimed
  at enhancing your experience. This update isn’t just about looks;
  we’re ensuring the website is fully optimised for mobile and tablet
  devices.

  The collaboration between our team and users like you has been
  instrumental in shaping the project. Your input and support have been
  invaluable, and we’re grateful for the community’s involvement in
  making this website the best it can be.

  Our design system has seen several updates, including new components
  like a variable landing page button, diverse icons (including social
  media and OCaml icons like Dune and opam), enhanced text styles,
  updated color variables, and more.

  We’ve completed the designs for all pages of the Learn area. Each page
  has been designed with attention to detail, ensuring consistency and
  coherence across all versions.

  If you’re curious and want to take a closer look at the designs, you
  can access our [Figma Design Files]. Please be aware that the content
  shown on the pages is not always accurate. We aim to provide our
  designer with better content for the mockups and UI going forward.

  The work on implementing the new designs for the light mode of the
  Learn area have been completed in December!

  *Relevant PRs and Activities:*
  • Implemented Learn UI from Figma [ocaml/ocaml.org#1798]
  • [@FatumaA] contributed: Improve platform page card styles
    [ocaml/ocaml.org#1752]
  • [@florentdrousset] contributed: Link exercises to tutorials
    [ocaml/ocaml.org#1753]
  • Add book links based on Figma design - [ocaml/ocaml.org#1834]
  • WIP: Documentation Search Feature - [ocaml/ocaml.org#1871]


  [Figma Design Files]
  <https://www.figma.com/file/6BSOEqSsyQeulwLo2pjs9r/Untitled?type=design&node-id=0%3A1&mode=design&t=GwVxvrXItX7k8pP9-1>

  [ocaml/ocaml.org#1798] <https://github.com/ocaml/ocaml.org/pull/1798>

  [@FatumaA] <https://github/com/FatumaA>

  [ocaml/ocaml.org#1752] <https://github.com/ocaml/ocaml.org/pull/1752>

  [@florentdrousset] <https://github.com/florentdrousset>

  [ocaml/ocaml.org#1753] <https://github.com/ocaml/ocaml.org/pull/1753>

  [ocaml/ocaml.org#1834] <https://github.com/ocaml/ocaml.org/pull/1834>

  [ocaml/ocaml.org#1871] <https://github.com/ocaml/ocaml.org/pull/1871>
