2024.01.23.org
**** 2. OCaml Documentation

In November, we focussed on addressing and incorporating community feedback on the "Getting Started" documents. The
comments and discussion on Discuss were so helpful. We encourage more of that!

We also worked on polishing "Basic Data Types" and "Values and Functions." Plus the team has been working on new
"Modules," "Functors," and "Libraries With Dune" documents, hoping to have it, and the ones in community review
(below), published before the end of the year.

*Relevant PRs and Activities:*

- *In Progress:*
  - Sets
  - Maps
  - Higher Order Functions
- *In Review (internal):*
  - [[https://github.com/ocaml/ocaml.org/pull/1800][Options]]
  - [[https://github.com/ocaml/ocaml.org/pull/1825][Running Commands in a Switch]]
  - [[https://github.com/ocaml/ocaml.org/pull/1881][Labelled Arguments]]
- *In Review (community):*
  - [[https://github.com/ocaml/ocaml.org/pull/1778][Modules, Functors, Libraries With Dune]] (see [[https://discuss.ocaml.org/t/draft-tutorials-on-modules-functors-and-libraries/][Discuss]])
  - [[https://github.com/ocaml/ocaml.org/pull/1400][File Manipulation]] (see [[https://discuss.ocaml.org/t/help-review-the-new-file-manipulation-tutorial-on-ocaml-org/12638][Discuss Thread]])
  - [[https://github.com/ocaml/ocaml.org/pull/1531][Polymorphic Variants]] (see [[https://discuss.ocaml.org/t/new-draft-tutorial-on-polymorphic-variants/13485][Discuss Thread]])
- *Published:*
  - [[https://github.com/ocaml/ocaml.org/pull/1825][Running Commands in an opam Switch]]
  - [[https://github.com/ocaml/ocaml.org/pull/1529][Mutable State / Imperative Programming]] (see [[https://discuss.ocaml.org/t/draft-tutorial-on-mutability-loops-and-imperative-programming/13504][Discuss Thread]])
  - Announcement on Discuss: [[https://discuss.ocaml.org/t/new-tutorials-on-basics-of-ocaml/13396][New Tutorials on Basics of OCaml]]
  - [[https://github.com/ocaml/ocaml.org/pull/1514][Basic Data Types]] (see [[https://discuss.ocaml.org/t/ocaml-org-tutorial-revamping-contd-basic-datatypes/12985][Discuss Thread]])
  - [[https://github.com/ocaml/ocaml.org/pull/1512][Functions and Values]] (see [[https://discuss.ocaml.org/t/ocaml-org-tutorial-revamping-cond-values-and-functions/13005][Discuss Thread]])
  - [[https://ocaml.org/docs/installing-ocaml][Installing OCaml]] (see [[https://discuss.ocaml.org/t/help-revamping-the-getting-started-tutorials-in-ocaml-org/12749][Discuss Thread]])
  - [[https://ocaml.org/docs/tour-of-ocaml][A Tour Of OCaml]] (see [[https://discuss.ocaml.org/t/help-revamping-the-getting-started-tutorials-in-ocaml-org/12749][Discuss Thread]])
  - [[https://ocaml.org/docs/your-first-program][Your First OCaml Program]] (see [[https://discuss.ocaml.org/t/help-revamping-the-getting-started-tutorials-in-ocaml-org/12749][Discuss Thread]])
  - [[https://ocaml.org/docs/opam-switch-introduction][Introduction to opam Switches]]
  - [[https://ocaml.org/docs/arm64-fix][Fix Homebrew Errors on Apple M1]]
  - [[https://ocaml.org/docs/operators][Operators]]
  - [[https://ocaml.org/docs/error-handling][Error Handling]] (see [[https://discuss.ocaml.org/t/ann-new-get-started-documentation-on-ocaml-org/13269][Discuss Thread]])
  - [[https://ocaml.org/docs/arrays][Arrays]] (see [[https://discuss.ocaml.org/t/feedback-needed-new-arrays-tutorial-on-ocaml-org/12683][Discuss Thread]])
  - [[https://ocaml.org/docs/sequences][Sequences]] (see [[https://discuss.ocaml.org/t/creating-a-tutorial-on-sequences/12091][Discuss Thread]])
- *Other Activity*:
    - We integrated pages from OCaml books into the Learn area, reproduced on OCaml.org with permission - [[https://github.com/ocaml/ocaml.org/pull/1766][ocaml/ocaml.org#1766]]:
        - Compiler & Runtime pages from [[https://dev.realworldocaml.org/][Real World OCaml]], and
        - Memoisation & Monads from [[https://cs3110.github.io/textbook/cover.html][OCaml Programming: Correct + Efficient + Beautiful]]
    - Rearranged the sections on the Language documentation tab - [[https://github.com/ocaml/ocaml.org/pull/1756][ocaml/ocaml.org#1756]]
    - Documentation formatting: Replace unsemantic blockquotes by highlighting [[https://github.com/ocaml/ocaml.org/pull/1759][ocaml/ocaml.org#1759]]
    - We improved the "Is OCaml Web Yet?" page, adding many more packages and reworking the text to more accurately capture the current state of the OCaml web ecosystem - [[https://github.com/ocaml/ocaml.org/pull/1843][ocaml/ocaml.org#1843]]
    - Editing on Basic Data Types - [[https://github.com/ocaml/ocaml.org/pull/1827][ocaml/ocaml.org#1827]]
    - Values & Functions :: Addressing suggestions from Issue #1762 - [[https://github.com/ocaml/ocaml.org/pull/1812][ocaml/ocaml.org#1812]]
- *Contributions:*
    - [[https://github.com/benjamin-thomas][@benjamin-thomas]] improved the `Map` document by providing a better example that uses different types for the key and value [[https://github.com/ocaml/ocaml.org/pull/1743][ocaml/ocaml.org#1743]]
    - [[https://github.com/leostera][@leostera]] simplified the "Bootstrapping a Project with Dune" guide - [[https://github.com/ocaml/ocaml.org/pull/1792][ocaml/ocaml.org#1792]]
    - [[https://github/com/FatumaA][@FatumaA]] fixed a typo in "Tour of OCaml" [[https://github.com/ocaml/ocaml.org/pull/1739][ocaml/ocaml.org#1739]]
    - [[https://github.com/binwang-dev][@binwang-dev]] contributed: Fix type inconsistency in tutorial [[https://github.com/ocaml/ocaml.org/pull/1757][ocaml/ocaml.org#1757]]
    - [[https://github.com/J3RN][@J3RN]] contributes: Fix escaping in "Your First OCaml Program" - [[https://github.com/ocaml/ocaml.org/pull/1846][ocaml/ocaml.org#1846]]
    - [[https://github.com/Sc4ramouche][@Sc4ramouche]] contributes: Add comparison of std containers guide to v3 docs
- [[https://github.com/ocaml/ocaml.org/pull/1828][ocaml/ocaml.org#1828]]
    - [[https://github.com/Sc4ramouche][@Sc4ramouche]] contributes: Fix typo in Tour of OCaml - [[https://github.com/ocaml/ocaml.org/pull/1820][ocaml/ocaml.org#1820]]
    - [[https://github.com/J3RN][@J3RN]] contributes: Fix broken "Install Platform Tools" link - [[https://github.com/ocaml/ocaml.org/pull/1841][ocaml/ocaml.org#1841]]

We started opening issues marked with "help wanted" to enable external contributors to help improve the docs. The
response has been overwhelmingly positive, and we're thrilled to keep this up and make the OCaml documentation
truly great with your help!

