2024.01.23.html
<li><a id="orgd462917"></a>2. OCaml Documentation<br />
<div class="outline-text-5" id="text-orgd462917">
<p>
In November, we focussed on addressing and incorporating community feedback on the &ldquo;Getting Started&rdquo; documents. The
comments and discussion on Discuss were so helpful. We encourage more of that!
</p>

<p>
We also worked on polishing &ldquo;Basic Data Types&rdquo; and &ldquo;Values and Functions.&rdquo; Plus the team has been working on new
&ldquo;Modules,&rdquo; &ldquo;Functors,&rdquo; and &ldquo;Libraries With Dune&rdquo; documents, hoping to have it, and the ones in community review
(below), published before the end of the year.
</p>

<p>
<b>Relevant PRs and Activities:</b>
</p>

<ul class="org-ul">
<li><b>In Progress:</b>
<ul class="org-ul">
<li>Sets</li>
<li>Maps</li>
<li>Higher Order Functions</li>
</ul></li>
<li><b>In Review (internal):</b>
<ul class="org-ul">
<li><a href="https://github.com/ocaml/ocaml.org/pull/1800">Options</a></li>
<li><a href="https://github.com/ocaml/ocaml.org/pull/1825">Running Commands in a Switch</a></li>
<li><a href="https://github.com/ocaml/ocaml.org/pull/1881">Labelled Arguments</a></li>
</ul></li>
<li><b>In Review (community):</b>
<ul class="org-ul">
<li><a href="https://github.com/ocaml/ocaml.org/pull/1778">Modules, Functors, Libraries With Dune</a> (see <a href="https://discuss.ocaml.org/t/draft-tutorials-on-modules-functors-and-libraries/">Discuss</a>)</li>
<li><a href="https://github.com/ocaml/ocaml.org/pull/1400">File Manipulation</a> (see <a href="https://discuss.ocaml.org/t/help-review-the-new-file-manipulation-tutorial-on-ocaml-org/12638">Discuss Thread</a>)</li>
<li><a href="https://github.com/ocaml/ocaml.org/pull/1531">Polymorphic Variants</a> (see <a href="https://discuss.ocaml.org/t/new-draft-tutorial-on-polymorphic-variants/13485">Discuss Thread</a>)</li>
</ul></li>
<li><b>Published:</b>
<ul class="org-ul">
<li><a href="https://github.com/ocaml/ocaml.org/pull/1825">Running Commands in an opam Switch</a></li>
<li><a href="https://github.com/ocaml/ocaml.org/pull/1529">Mutable State / Imperative Programming</a> (see <a href="https://discuss.ocaml.org/t/draft-tutorial-on-mutability-loops-and-imperative-programming/13504">Discuss Thread</a>)</li>
<li>Announcement on Discuss: <a href="https://discuss.ocaml.org/t/new-tutorials-on-basics-of-ocaml/13396">New Tutorials on Basics of OCaml</a></li>
<li><a href="https://github.com/ocaml/ocaml.org/pull/1514">Basic Data Types</a> (see <a href="https://discuss.ocaml.org/t/ocaml-org-tutorial-revamping-contd-basic-datatypes/12985">Discuss Thread</a>)</li>
<li><a href="https://github.com/ocaml/ocaml.org/pull/1512">Functions and Values</a> (see <a href="https://discuss.ocaml.org/t/ocaml-org-tutorial-revamping-cond-values-and-functions/13005">Discuss Thread</a>)</li>
<li><a href="https://ocaml.org/docs/installing-ocaml">Installing OCaml</a> (see <a href="https://discuss.ocaml.org/t/help-revamping-the-getting-started-tutorials-in-ocaml-org/12749">Discuss Thread</a>)</li>
<li><a href="https://ocaml.org/docs/tour-of-ocaml">A Tour Of OCaml</a> (see <a href="https://discuss.ocaml.org/t/help-revamping-the-getting-started-tutorials-in-ocaml-org/12749">Discuss Thread</a>)</li>
<li><a href="https://ocaml.org/docs/your-first-program">Your First OCaml Program</a> (see <a href="https://discuss.ocaml.org/t/help-revamping-the-getting-started-tutorials-in-ocaml-org/12749">Discuss Thread</a>)</li>
<li><a href="https://ocaml.org/docs/opam-switch-introduction">Introduction to opam Switches</a></li>
<li><a href="https://ocaml.org/docs/arm64-fix">Fix Homebrew Errors on Apple M1</a></li>
<li><a href="https://ocaml.org/docs/operators">Operators</a></li>
<li><a href="https://ocaml.org/docs/error-handling">Error Handling</a> (see <a href="https://discuss.ocaml.org/t/ann-new-get-started-documentation-on-ocaml-org/13269">Discuss Thread</a>)</li>
<li><a href="https://ocaml.org/docs/arrays">Arrays</a> (see <a href="https://discuss.ocaml.org/t/feedback-needed-new-arrays-tutorial-on-ocaml-org/12683">Discuss Thread</a>)</li>
<li><a href="https://ocaml.org/docs/sequences">Sequences</a> (see <a href="https://discuss.ocaml.org/t/creating-a-tutorial-on-sequences/12091">Discuss Thread</a>)</li>
</ul></li>
<li><b>Other Activity</b>:
<ul class="org-ul">
<li>We integrated pages from OCaml books into the Learn area, reproduced on OCaml.org with permission - <a href="https://github.com/ocaml/ocaml.org/pull/1766">ocaml/ocaml.org#1766</a>:
<ul class="org-ul">
<li>Compiler &amp; Runtime pages from <a href="https://dev.realworldocaml.org/">Real World OCaml</a>, and</li>
<li>Memoisation &amp; Monads from <a href="https://cs3110.github.io/textbook/cover.html">OCaml Programming: Correct + Efficient + Beautiful</a></li>
</ul></li>
<li>Rearranged the sections on the Language documentation tab - <a href="https://github.com/ocaml/ocaml.org/pull/1756">ocaml/ocaml.org#1756</a></li>
<li>Documentation formatting: Replace unsemantic blockquotes by highlighting <a href="https://github.com/ocaml/ocaml.org/pull/1759">ocaml/ocaml.org#1759</a></li>
<li>We improved the &ldquo;Is OCaml Web Yet?&rdquo; page, adding many more packages and reworking the text to more accurately capture the current state of the OCaml web ecosystem - <a href="https://github.com/ocaml/ocaml.org/pull/1843">ocaml/ocaml.org#1843</a></li>
<li>Editing on Basic Data Types - <a href="https://github.com/ocaml/ocaml.org/pull/1827">ocaml/ocaml.org#1827</a></li>
<li id="Values &amp; Functions">Addressing suggestions from Issue #1762 - <a href="https://github.com/ocaml/ocaml.org/pull/1812">ocaml/ocaml.org#1812</a></li>
</ul></li>
<li><b>Contributions:</b>
<ul class="org-ul">
<li><a href="https://github.com/benjamin-thomas">@benjamin-thomas</a> improved the `Map` document by providing a better example that uses different types for the key and value <a href="https://github.com/ocaml/ocaml.org/pull/1743">ocaml/ocaml.org#1743</a></li>
<li><a href="https://github.com/leostera">@leostera</a> simplified the &ldquo;Bootstrapping a Project with Dune&rdquo; guide - <a href="https://github.com/ocaml/ocaml.org/pull/1792">ocaml/ocaml.org#1792</a></li>
<li><a href="https://github/com/FatumaA">@FatumaA</a> fixed a typo in &ldquo;Tour of OCaml&rdquo; <a href="https://github.com/ocaml/ocaml.org/pull/1739">ocaml/ocaml.org#1739</a></li>
<li><a href="https://github.com/binwang-dev">@binwang-dev</a> contributed: Fix type inconsistency in tutorial <a href="https://github.com/ocaml/ocaml.org/pull/1757">ocaml/ocaml.org#1757</a></li>
<li><a href="https://github.com/J3RN">@J3RN</a> contributes: Fix escaping in &ldquo;Your First OCaml Program&rdquo; - <a href="https://github.com/ocaml/ocaml.org/pull/1846">ocaml/ocaml.org#1846</a></li>
<li><a href="https://github.com/Sc4ramouche">@Sc4ramouche</a> contributes: Add comparison of std containers guide to v3 docs</li>
</ul></li>
<li><a href="https://github.com/ocaml/ocaml.org/pull/1828">ocaml/ocaml.org#1828</a>
<ul class="org-ul">
<li><a href="https://github.com/Sc4ramouche">@Sc4ramouche</a> contributes: Fix typo in Tour of OCaml - <a href="https://github.com/ocaml/ocaml.org/pull/1820">ocaml/ocaml.org#1820</a></li>
<li><a href="https://github.com/J3RN">@J3RN</a> contributes: Fix broken &ldquo;Install Platform Tools&rdquo; link - <a href="https://github.com/ocaml/ocaml.org/pull/1841">ocaml/ocaml.org#1841</a></li>
</ul></li>
</ul>

<p>
We started opening issues marked with &ldquo;help wanted&rdquo; to enable external contributors to help improve the docs. The
response has been overwhelmingly positive, and we&rsquo;re thrilled to keep this up and make the OCaml documentation
truly great with your help!
</p>
</div>
</li>
</ul>
</div>
