2024.01.23.txt


◊ 2. OCaml Documentation

  In November, we focussed on addressing and incorporating community
  feedback on the “Getting Started” documents. The comments and
  discussion on Discuss were so helpful. We encourage more of that!

  We also worked on polishing “Basic Data Types” and “Values and
  Functions.” Plus the team has been working on new “Modules,”
  “Functors,” and “Libraries With Dune” documents, hoping to have it,
  and the ones in community review (below), published before the end of
  the year.

  *Relevant PRs and Activities:*

  • *In Progress:*
    • Sets
    • Maps
    • Higher Order Functions
  • *In Review (internal):*
    • [Options]
    • [Running Commands in a Switch]
    • [Labelled Arguments]
  • *In Review (community):*
    • [Modules, Functors, Libraries With Dune] (see [Discuss])
    • [File Manipulation] (see [Discuss Thread])
    • [Polymorphic Variants] (see [Discuss Thread])
  • *Published:*
    • [Running Commands in an opam Switch]
    • [Mutable State / Imperative Programming] (see [Discuss Thread])
    • Announcement on Discuss: [New Tutorials on Basics of OCaml]
    • [Basic Data Types] (see [Discuss Thread])
    • [Functions and Values] (see [Discuss Thread])
    • [Installing OCaml] (see [Discuss Thread])
    • [A Tour Of OCaml] (see [Discuss Thread])
    • [Your First OCaml Program] (see [Discuss Thread])
    • [Introduction to opam Switches]
    • [Fix Homebrew Errors on Apple M1]
    • [Operators]
    • [Error Handling] (see [Discuss Thread])
    • [Arrays] (see [Discuss Thread])
    • [Sequences] (see [Discuss Thread])
  • *Other Activity*:
    • We integrated pages from OCaml books into the Learn area,
      reproduced on OCaml.org with permission - [ocaml/ocaml.org#1766]:
      • Compiler & Runtime pages from [Real World OCaml], and
      • Memoisation & Monads from [OCaml Programming: Correct +
        Efficient + Beautiful]
    • Rearranged the sections on the Language documentation tab -
      [ocaml/ocaml.org#1756]
    • Documentation formatting: Replace unsemantic blockquotes by
      highlighting [ocaml/ocaml.org#1759]
    • We improved the “Is OCaml Web Yet?” page, adding many more
      packages and reworking the text to more accurately capture the
      current state of the OCaml web ecosystem - [ocaml/ocaml.org#1843]
    • Editing on Basic Data Types - [ocaml/ocaml.org#1827]
    • Addressing suggestions from Issue #1762 - [ocaml/ocaml.org#1812]
  • *Contributions:*
    • [@benjamin-thomas] improved the `Map` document by providing a
      better example that uses different types for the key and value
      [ocaml/ocaml.org#1743]
    • [@leostera] simplified the “Bootstrapping a Project with Dune”
      guide - [ocaml/ocaml.org#1792]
    • [@FatumaA] fixed a typo in “Tour of OCaml” [ocaml/ocaml.org#1739]
    • [@binwang-dev] contributed: Fix type inconsistency in tutorial
      [ocaml/ocaml.org#1757]
    • [@J3RN] contributes: Fix escaping in “Your First OCaml Program” -
      [ocaml/ocaml.org#1846]
    • [@Sc4ramouche] contributes: Add comparison of std containers guide
      to v3 docs
  • [ocaml/ocaml.org#1828]
    • [@Sc4ramouche] contributes: Fix typo in Tour of OCaml -
      [ocaml/ocaml.org#1820]
    • [@J3RN] contributes: Fix broken “Install Platform Tools” link -
      [ocaml/ocaml.org#1841]

  We started opening issues marked with “help wanted” to enable external
  contributors to help improve the docs. The response has been
  overwhelmingly positive, and we’re thrilled to keep this up and make
  the OCaml documentation truly great with your help!


  [Options] <https://github.com/ocaml/ocaml.org/pull/1800>

  [Running Commands in a Switch]
  <https://github.com/ocaml/ocaml.org/pull/1825>

  [Labelled Arguments] <https://github.com/ocaml/ocaml.org/pull/1881>

  [Modules, Functors, Libraries With Dune]
  <https://github.com/ocaml/ocaml.org/pull/1778>

  [Discuss]
  <https://discuss.ocaml.org/t/draft-tutorials-on-modules-functors-and-libraries/>

  [File Manipulation] <https://github.com/ocaml/ocaml.org/pull/1400>

  [Discuss Thread]
  <https://discuss.ocaml.org/t/help-review-the-new-file-manipulation-tutorial-on-ocaml-org/12638>

  [Polymorphic Variants] <https://github.com/ocaml/ocaml.org/pull/1531>

  [Discuss Thread]
  <https://discuss.ocaml.org/t/new-draft-tutorial-on-polymorphic-variants/13485>

  [Running Commands in an opam Switch]
  <https://github.com/ocaml/ocaml.org/pull/1825>

  [Mutable State / Imperative Programming]
  <https://github.com/ocaml/ocaml.org/pull/1529>

  [Discuss Thread]
  <https://discuss.ocaml.org/t/draft-tutorial-on-mutability-loops-and-imperative-programming/13504>

  [New Tutorials on Basics of OCaml]
  <https://discuss.ocaml.org/t/new-tutorials-on-basics-of-ocaml/13396>

  [Basic Data Types] <https://github.com/ocaml/ocaml.org/pull/1514>

  [Discuss Thread]
  <https://discuss.ocaml.org/t/ocaml-org-tutorial-revamping-contd-basic-datatypes/12985>

  [Functions and Values] <https://github.com/ocaml/ocaml.org/pull/1512>

  [Discuss Thread]
  <https://discuss.ocaml.org/t/ocaml-org-tutorial-revamping-cond-values-and-functions/13005>

  [Installing OCaml] <https://ocaml.org/docs/installing-ocaml>

  [Discuss Thread]
  <https://discuss.ocaml.org/t/help-revamping-the-getting-started-tutorials-in-ocaml-org/12749>

  [A Tour Of OCaml] <https://ocaml.org/docs/tour-of-ocaml>

  [Your First OCaml Program] <https://ocaml.org/docs/your-first-program>

  [Introduction to opam Switches]
  <https://ocaml.org/docs/opam-switch-introduction>

  [Fix Homebrew Errors on Apple M1] <https://ocaml.org/docs/arm64-fix>

  [Operators] <https://ocaml.org/docs/operators>

  [Error Handling] <https://ocaml.org/docs/error-handling>

  [Discuss Thread]
  <https://discuss.ocaml.org/t/ann-new-get-started-documentation-on-ocaml-org/13269>

  [Arrays] <https://ocaml.org/docs/arrays>

  [Discuss Thread]
  <https://discuss.ocaml.org/t/feedback-needed-new-arrays-tutorial-on-ocaml-org/12683>

  [Sequences] <https://ocaml.org/docs/sequences>

  [Discuss Thread]
  <https://discuss.ocaml.org/t/creating-a-tutorial-on-sequences/12091>

  [ocaml/ocaml.org#1766] <https://github.com/ocaml/ocaml.org/pull/1766>

  [Real World OCaml] <https://dev.realworldocaml.org/>

  [OCaml Programming: Correct + Efficient + Beautiful]
  <https://cs3110.github.io/textbook/cover.html>

  [ocaml/ocaml.org#1756] <https://github.com/ocaml/ocaml.org/pull/1756>

  [ocaml/ocaml.org#1759] <https://github.com/ocaml/ocaml.org/pull/1759>

  [ocaml/ocaml.org#1843] <https://github.com/ocaml/ocaml.org/pull/1843>

  [ocaml/ocaml.org#1827] <https://github.com/ocaml/ocaml.org/pull/1827>

  [ocaml/ocaml.org#1812] <https://github.com/ocaml/ocaml.org/pull/1812>

  [@benjamin-thomas] <https://github.com/benjamin-thomas>

  [ocaml/ocaml.org#1743] <https://github.com/ocaml/ocaml.org/pull/1743>

  [@leostera] <https://github.com/leostera>

  [ocaml/ocaml.org#1792] <https://github.com/ocaml/ocaml.org/pull/1792>

  [@FatumaA] <https://github/com/FatumaA>

  [ocaml/ocaml.org#1739] <https://github.com/ocaml/ocaml.org/pull/1739>

  [@binwang-dev] <https://github.com/binwang-dev>

  [ocaml/ocaml.org#1757] <https://github.com/ocaml/ocaml.org/pull/1757>

  [@J3RN] <https://github.com/J3RN>

  [ocaml/ocaml.org#1846] <https://github.com/ocaml/ocaml.org/pull/1846>

  [@Sc4ramouche] <https://github.com/Sc4ramouche>

  [ocaml/ocaml.org#1828] <https://github.com/ocaml/ocaml.org/pull/1828>

  [ocaml/ocaml.org#1820] <https://github.com/ocaml/ocaml.org/pull/1820>

  [ocaml/ocaml.org#1841] <https://github.com/ocaml/ocaml.org/pull/1841>


Upcoming Dark Mode
╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌
