2024.01.23.org
*** Upcoming Dark Mode

In December, [[https://github.com/oyenuga17][oyenuga17]] started to implement the new dark mode on OCaml.org. Plans
are to complete and activate the dark mode based on browser / operating system preferences by early March.

We continuously merge small patches into ocaml.org, and you can take a look at completed dark mode pages on
https://staging.ocaml.org. We placed a button at the bottom of the page to toggle the dark mode on staging (this is
not going to be released, it is only a means for us to review the dark mode pages).

*Relevant Activities and PRs:*
- Implement dark mode on learn area landing page - [[https://github.com/ocaml/ocaml.org/pull/1836][ocaml/ocaml.org#1836]]
- UI design for dark mode on all OCaml.org pages, and resulting Design System changes

*** Announcing the Outreachy Interns

In November, we reviewed and rated the Outreachy contributions for the dark mode project and the GUI project and
selected the two interns. [[https://github.com/oyenuga17][@oyenuga17]] is working with the OCaml.org team on
implementing the dark mode, while [[https://github.com/IdaraNabuk][@IdaraNabuk]] has been selected for the GUI
project. Congratulations [[https://github.com/IdaraNabuk][@IdaraNabuk]] and
[[https://github.com/oyenuga17][@oyenuga17]]!

Since the Outreachy application period ended in October, we list all the remaining pull requests done on Outreachy
Issues in the "General Improvements" section below.

