2024.01.23.html
<div id="outline-container-orgfc6e012" class="outline-4">
<h4 id="orgfc6e012">Upcoming Dark Mode</h4>
<div class="outline-text-4" id="text-orgfc6e012">
<p>
In December, <a href="https://github.com/oyenuga17">oyenuga17</a> started to implement the new dark mode on OCaml.org. Plans
are to complete and activate the dark mode based on browser / operating system preferences by early March.
</p>

<p>
We continuously merge small patches into ocaml.org, and you can take a look at completed dark mode pages on
<a href="https://staging.ocaml.org">https://staging.ocaml.org</a>. We placed a button at the bottom of the page to toggle the dark mode on staging (this is
not going to be released, it is only a means for us to review the dark mode pages).
</p>

<p>
<b>Relevant Activities and PRs:</b>
</p>
<ul class="org-ul">
<li>Implement dark mode on learn area landing page - <a href="https://github.com/ocaml/ocaml.org/pull/1836">ocaml/ocaml.org#1836</a></li>
<li>UI design for dark mode on all OCaml.org pages, and resulting Design System changes</li>
</ul>
</div>
</div>
<div id="outline-container-org63e25cf" class="outline-4">
<h4 id="org63e25cf">Announcing the Outreachy Interns</h4>
<div class="outline-text-4" id="text-org63e25cf">
<p>
In November, we reviewed and rated the Outreachy contributions for the dark mode project and the GUI project and
selected the two interns. <a href="https://github.com/oyenuga17">@oyenuga17</a> is working with the OCaml.org team on
implementing the dark mode, while <a href="https://github.com/IdaraNabuk">@IdaraNabuk</a> has been selected for the GUI
project. Congratulations <a href="https://github.com/IdaraNabuk">@IdaraNabuk</a> and
<a href="https://github.com/oyenuga17">@oyenuga17</a>!
</p>

<p>
Since the Outreachy application period ended in October, we list all the remaining pull requests done on Outreachy
Issues in the &ldquo;General Improvements&rdquo; section below.
</p>
</div>
</div>
