2024.01.23.org
*** General Improvements

*Most Important Changes TLDR*:
- There's now a self-hosted Plausible.io instance for OCaml.org, accessible at https://plausible.ci.dev/ocaml.org!
- You can see the different OCaml teams (Compiler, Platform, Packaging, Infrastructure, OCaml.org) and the maintainers of relevant repositories at the new governance page at https://ocaml.org/governance!
- The OCaml Logo now has a dedicated page at https://ocaml.org/logo!
- We’re now displaying a package's README on the package overview page.
- You can now [[https://github.com/ocaml/ocaml.org/blob/main/CONTRIBUTING.md#content-upcoming_event][list upcoming events]] with date and time on https://ocaml.org/community.
- OCaml.org now has social media images, so that sharing OCaml.org links looks nicer.

Many thanks go out to the many contributors who helped improve OCaml.org in November and December. Find them listed
below!

*Relevant PRs and Activities:*
- Features / Improvements:
  - Added a governance page that lists the maintainers and dev meetings of the compiler, all the projects of the OCaml Platform, and the ocaml.org infrastructure - [[https://github.com/ocaml/ocaml.org/pull/1239][ocaml/ocaml.org#1239]]
  - [[https://github.com/IdaraNabuk][@IdaraNabuk]] contributed: Added the ability to record upcoming events to the community page - [[https://github.com/ocaml/ocaml.org/pull/1717][ocaml/ocaml.org#1717]]
  - [[https://github.com/Girish-Jangam][@Girish-Jangam]] contributed: Added a page for the OCaml logo - [[https://github.com/ocaml/ocaml.org/pull/1711][ocaml/ocaml.org#1711]]
  - Add ability to disable an OCaml Planet source / fix scraper and scrape missing planet posts - [[https://github.com/ocaml/ocaml.org/pull/1734][ocaml/ocaml.org#1734]]
  - [[https://github.com/leostera][@leostera]] contributed: Package search UX improvements - [[https://github.com/ocaml/ocaml.org/pull/1691][ocaml/ocaml.org#1691]]
    - Added an OpenSearch manifest, so you can add the OCaml packages search to your browser search bar
    - Made search input in main navbar gain tab-focus earlier
    - Set tabindex="1" for the in-package search input on the package documentation page
    - Autofocus the search inupt on the package search results page
  - [[https://github.com/mays4][@mays4]] contributed: Add links to CONTRIBUTING.md for all data items that can be contributed - [[https://github.com/ocaml/ocaml.org/pull/1682][ocaml/ocaml.org#1682]]
  - [[https://github.com/m-spitfire][@m-spitfire]] contributed: Entries on the changelog page are now paginated - [[https://github.com/ocaml/ocaml.org/pull/1751][ocaml/ocaml.org#1751]]
  - Add missing social media images to OCaml.org HTML metadata. Now, posts shared on social media have the OCaml logo as image, which is much better than having no image - [[https://github.com/ocaml/ocaml.org/pull/1784][ocaml/ocaml.org#1784]]
  - We're now displaying a package's README on the package overview page. This was part of one of the design options from the package area redesign earlier this year. However, it wasn't entirely clear that this was the right thing to do. More confirmation came up in terms of people asking for this, so we did it. - [[https://github.com/ocaml/ocaml.org/pull/1832][ocaml/ocaml.org#1832]]
  - Update to Tailwind CSS 3.3.6 - [[https://github.com/ocaml/ocaml.org/pull/1850][ocaml/ocaml.org#1850]]
  - Added table of contents to jump to individual sections on "Is OCaml Web yet" - [[https://github.com/ocaml/ocaml.org/pull/1849][ocaml/ocaml.org#1849]]
  - [[https://github.com/RWUBAKWANAYO][@RWUBAKWANAYO]] contributed: Improved responsive layout on releases page - [[https://github.com/ocaml/ocaml.org/pull/1716][ocaml/ocaml.org#1716]]
  - [[https://github.com/kiyov09][@kiyov09]] contributed: Reduced the number of news items in the blog page to have a similar height to the OCaml Planet column - [[https://github.com/ocaml/ocaml.org/pull/1754][ocaml/ocaml.org#1754]]
  - [[https://github.com/oyenuga17][@oyenuga17]] contributed: Improved responsive collapsing of the table on the papers page - [[https://github.com/ocaml/ocaml.org/pull/1741][ocaml/ocaml.org#1741]]
- Bugfixes:
  - Adjust CSS order of elements of main nav, starting from 0 - [[https://github.com/ocaml/ocaml.org/pull/1745][ocaml/ocaml.org#1745]]
  - Set correct background color on learn tabs select element - [[https://github.com/ocaml/ocaml.org/pull/1746][ocaml/ocaml.org#1746]]
  - [[https://github.com/Solar-Rays][@Solar-Rays]] contributed: Remove links from outreachy project description to prevent overflow - [[https://github.com/ocaml/ocaml.org/pull/1764][ocaml/ocaml.org#1764]]
  - Patch upstream dependency `river` to fall back to feed entry's `id` if `links` tag does not exist. This allows more feeds to be scraped successfully. - [[https://github.com/tarides/river/pull/11][tarides/river#11]]
  - Added missing Code of Conduct Route - [[https://github.com/ocaml/ocaml.org/pull/1781][ocaml/ocaml.org#1781]]
  - Added missing 'Platform Tools' link in footer - [[https://github.com/ocaml/ocaml.org/pull/1788][ocaml/ocaml.org#1788]]
  - [[https://github.com/AndroGenius-codes][@AndroGenius-codes]] contributed: Fixed a bug in pagination where the page number "1" was displayed twice when all the results would fit on a single page - [[https://github.com/ocaml/ocaml.org/pull/1729][ocaml/ocaml.org#1729]]
  - [[https://github.com/Demmythetechie][@Demmythetechie]] contributed: Add `word-wrap: break-word` to the Tailwind Typography prose class to prevent long URLs in content areas from overflowing - [[https://github.com/ocaml/ocaml.org/pull/1722][ocaml/ocaml.org#1722]]
  - [[https://github.com/AndroGenius-codes][@AndroGenius-codes]] contributed: Shorten text on Outreachy Projects link on the community page to prevent overflow - [[https://github.com/ocaml/ocaml.org/pull/1749][ocaml/ocaml.org#1749]]
  - [[https://github.com/oyenuga17][@oyenuga17]] contributed: Render search query as input value on the papers page and the releases page - [[https://github.com/ocaml/ocaml.org/pull/1747][ocaml/ocaml.org#1747]]
  - [[https://github/com/FatumaA][@FatumaA]] contributed: Added spacing below "See All Releases" button on homepage - [[https://github.com/ocaml/ocaml.org/pull/1740][ocaml/ocaml.org#1740]]
  - [[https://github.com/RWUBAKWANAYO][@RWUBAKWANAYO]] contributed: Resolve text styling issue in release list headers [[https://github.com/ocaml/ocaml.org/pull/1773][ocaml/ocaml.org#1773]]
  - [[https://github.com/kevanantha][@kevanantha]] contributed: Fix invalid link for exercises [[https://github.com/ocaml/ocaml.org/pull/1802][ocaml/ocaml.org#1802]]
- Other:
  - [[https://github.com/oyenuga17][@oyenuga17]] contributed: Replaced dependency `omd` with `cmarkit` - [[https://github.com/ocaml/ocaml.org/pull/1642][ocaml/ocaml.org#1642]]. Thanks for this excellent and challenging contribution!
  - Remove Yoshi tool - [[https://github.com/ocaml/ocaml.org/pull/1735][ocaml/ocaml.org#1735]]
  - Removed dream-dashboard, it was replaced a self-hosted plausible.io instance - [[https://github.com/ocaml/ocaml.org/pull/1736][ocaml/ocaml.org#1736]]
  - Rename Tutorials->Documentation in meta title of Learn Area - [[https://github.com/ocaml/ocaml.org/pull/1789][ocaml/ocaml.org#1789]]
- Content:
  - Added "Introduction to Functional Programming and the Structure of Programming Languages using OCaml" to the books section - [[https://github.com/ocaml/ocaml.org/pull/1744][ocaml/ocaml.org#1744]]
  - Added the changelog for opam.2.2.0~alpha3 - [[https://github.com/ocaml/ocaml.org/pull/1771][ocaml/ocaml.org#1771]]
  - Update title of Platform Roadmap document to 'OCaml Platform Roadmap' - [[https://github.com/ocaml/ocaml.org/pull/1790][ocaml/ocaml.org#1790]]
  - Add some feeds to the OCaml Planet - [[https://github.com/ocaml/ocaml.org/pull/1779][ocaml/ocaml.org#1779]]
  - Added "Practical OCaml" blog to the Planet - [[https://github.com/ocaml/ocaml.org/pull/1806][ocaml/ocaml.org#1806]]
  - [[https://github.com/caisar-platform][@caisar-platform]] contributed: Fix broken link in CEA Research Engineer offer. [[https://github.com/ocaml/ocaml.org/pull/1787][ocaml/ocaml.org#1787]]
  - [[https://github.com/KihongHeo][@KihongHeo]] contributed: Add KAIST as an academic institution [[https://github.com/ocaml/ocaml.org/pull/1791][ocaml/ocaml.org#1791]]
  - [[https://github.com/hetzenmat][@hetzenmat]] contributes: Fix wrong release date for 5.1.1 - [[https://github.com/ocaml/ocaml.org/pull/1858][ocaml/ocaml.org#1858]]
  - [[https://github.com/zapashcanon][@zapashcanon]] contributes: Fix order of presentations - [[https://github.com/ocaml/ocaml.org/pull/1859][ocaml/ocaml.org#1859]]
  - [[https://github.com/oyenuga17][@oyenuga17]] contributes: add outreachy blog | introduce yourself - [[https://github.com/ocaml/ocaml.org/pull/1848][ocaml/ocaml.org#1848]]
  - [[https://github.com/IdaraNabuk][@IdaraNabuk]] contributed: Add Outreachy Blog Post to OCaml Planet [[https://github.com/ocaml/ocaml.org/pull/1878][ocaml/ocaml.org#1878]]
  - Added 'Retrofitting Parallelism onto OCaml' paper - [[https://github.com/ocaml/ocaml.org/pull/1875][ocaml/ocaml.org#1875]]
      



