2024.01.23.html
<div id="outline-container-orgf0597ff" class="outline-4">
<h4 id="orgf0597ff">General Improvements</h4>
<div class="outline-text-4" id="text-orgf0597ff">
<p>
<b>Most Important Changes TLDR</b>:
</p>
<ul class="org-ul">
<li>There&rsquo;s now a self-hosted Plausible.io instance for OCaml.org, accessible at <a href="https://plausible.ci.dev/ocaml.org">https://plausible.ci.dev/ocaml.org</a>!</li>
<li>You can see the different OCaml teams (Compiler, Platform, Packaging, Infrastructure, OCaml.org) and the maintainers of relevant repositories at the new governance page at <a href="https://ocaml.org/governance">https://ocaml.org/governance</a>!</li>
<li>The OCaml Logo now has a dedicated page at <a href="https://ocaml.org/logo">https://ocaml.org/logo</a>!</li>
<li>We’re now displaying a package&rsquo;s README on the package overview page.</li>
<li>You can now <a href="https://github.com/ocaml/ocaml.org/blob/main/CONTRIBUTING.md#content-upcoming_event">list upcoming events</a> with date and time on <a href="https://ocaml.org/community">https://ocaml.org/community</a>.</li>
<li>OCaml.org now has social media images, so that sharing OCaml.org links looks nicer.</li>
</ul>

<p>
Many thanks go out to the many contributors who helped improve OCaml.org in November and December. Find them listed
below!
</p>

<p>
<b>Relevant PRs and Activities:</b>
</p>
<ul class="org-ul">
<li>Features / Improvements:
<ul class="org-ul">
<li>Added a governance page that lists the maintainers and dev meetings of the compiler, all the projects of the OCaml Platform, and the ocaml.org infrastructure - <a href="https://github.com/ocaml/ocaml.org/pull/1239">ocaml/ocaml.org#1239</a></li>
<li><a href="https://github.com/IdaraNabuk">@IdaraNabuk</a> contributed: Added the ability to record upcoming events to the community page - <a href="https://github.com/ocaml/ocaml.org/pull/1717">ocaml/ocaml.org#1717</a></li>
<li><a href="https://github.com/Girish-Jangam">@Girish-Jangam</a> contributed: Added a page for the OCaml logo - <a href="https://github.com/ocaml/ocaml.org/pull/1711">ocaml/ocaml.org#1711</a></li>
<li>Add ability to disable an OCaml Planet source / fix scraper and scrape missing planet posts - <a href="https://github.com/ocaml/ocaml.org/pull/1734">ocaml/ocaml.org#1734</a></li>
<li><a href="https://github.com/leostera">@leostera</a> contributed: Package search UX improvements - <a href="https://github.com/ocaml/ocaml.org/pull/1691">ocaml/ocaml.org#1691</a>
<ul class="org-ul">
<li>Added an OpenSearch manifest, so you can add the OCaml packages search to your browser search bar</li>
<li>Made search input in main navbar gain tab-focus earlier</li>
<li>Set tabindex=&ldquo;1&rdquo; for the in-package search input on the package documentation page</li>
<li>Autofocus the search inupt on the package search results page</li>
</ul></li>
<li><a href="https://github.com/mays4">@mays4</a> contributed: Add links to CONTRIBUTING.md for all data items that can be contributed - <a href="https://github.com/ocaml/ocaml.org/pull/1682">ocaml/ocaml.org#1682</a></li>
<li><a href="https://github.com/m-spitfire">@m-spitfire</a> contributed: Entries on the changelog page are now paginated - <a href="https://github.com/ocaml/ocaml.org/pull/1751">ocaml/ocaml.org#1751</a></li>
<li>Add missing social media images to OCaml.org HTML metadata. Now, posts shared on social media have the OCaml logo as image, which is much better than having no image - <a href="https://github.com/ocaml/ocaml.org/pull/1784">ocaml/ocaml.org#1784</a></li>
<li>We&rsquo;re now displaying a package&rsquo;s README on the package overview page. This was part of one of the design options from the package area redesign earlier this year. However, it wasn&rsquo;t entirely clear that this was the right thing to do. More confirmation came up in terms of people asking for this, so we did it. - <a href="https://github.com/ocaml/ocaml.org/pull/1832">ocaml/ocaml.org#1832</a></li>
<li>Update to Tailwind CSS 3.3.6 - <a href="https://github.com/ocaml/ocaml.org/pull/1850">ocaml/ocaml.org#1850</a></li>
<li>Added table of contents to jump to individual sections on &ldquo;Is OCaml Web yet&rdquo; - <a href="https://github.com/ocaml/ocaml.org/pull/1849">ocaml/ocaml.org#1849</a></li>
<li><a href="https://github.com/RWUBAKWANAYO">@RWUBAKWANAYO</a> contributed: Improved responsive layout on releases page - <a href="https://github.com/ocaml/ocaml.org/pull/1716">ocaml/ocaml.org#1716</a></li>
<li><a href="https://github.com/kiyov09">@kiyov09</a> contributed: Reduced the number of news items in the blog page to have a similar height to the OCaml Planet column - <a href="https://github.com/ocaml/ocaml.org/pull/1754">ocaml/ocaml.org#1754</a></li>
<li><a href="https://github.com/oyenuga17">@oyenuga17</a> contributed: Improved responsive collapsing of the table on the papers page - <a href="https://github.com/ocaml/ocaml.org/pull/1741">ocaml/ocaml.org#1741</a></li>
</ul></li>
<li>Bugfixes:
<ul class="org-ul">
<li>Adjust CSS order of elements of main nav, starting from 0 - <a href="https://github.com/ocaml/ocaml.org/pull/1745">ocaml/ocaml.org#1745</a></li>
<li>Set correct background color on learn tabs select element - <a href="https://github.com/ocaml/ocaml.org/pull/1746">ocaml/ocaml.org#1746</a></li>
<li><a href="https://github.com/Solar-Rays">@Solar-Rays</a> contributed: Remove links from outreachy project description to prevent overflow - <a href="https://github.com/ocaml/ocaml.org/pull/1764">ocaml/ocaml.org#1764</a></li>
<li>Patch upstream dependency `river` to fall back to feed entry&rsquo;s `id` if `links` tag does not exist. This allows more feeds to be scraped successfully. - <a href="https://github.com/tarides/river/pull/11">tarides/river#11</a></li>
<li>Added missing Code of Conduct Route - <a href="https://github.com/ocaml/ocaml.org/pull/1781">ocaml/ocaml.org#1781</a></li>
<li>Added missing &rsquo;Platform Tools&rsquo; link in footer - <a href="https://github.com/ocaml/ocaml.org/pull/1788">ocaml/ocaml.org#1788</a></li>
<li><a href="https://github.com/AndroGenius-codes">@AndroGenius-codes</a> contributed: Fixed a bug in pagination where the page number &ldquo;1&rdquo; was displayed twice when all the results would fit on a single page - <a href="https://github.com/ocaml/ocaml.org/pull/1729">ocaml/ocaml.org#1729</a></li>
<li><a href="https://github.com/Demmythetechie">@Demmythetechie</a> contributed: Add `word-wrap: break-word` to the Tailwind Typography prose class to prevent long URLs in content areas from overflowing - <a href="https://github.com/ocaml/ocaml.org/pull/1722">ocaml/ocaml.org#1722</a></li>
<li><a href="https://github.com/AndroGenius-codes">@AndroGenius-codes</a> contributed: Shorten text on Outreachy Projects link on the community page to prevent overflow - <a href="https://github.com/ocaml/ocaml.org/pull/1749">ocaml/ocaml.org#1749</a></li>
<li><a href="https://github.com/oyenuga17">@oyenuga17</a> contributed: Render search query as input value on the papers page and the releases page - <a href="https://github.com/ocaml/ocaml.org/pull/1747">ocaml/ocaml.org#1747</a></li>
<li><a href="https://github/com/FatumaA">@FatumaA</a> contributed: Added spacing below &ldquo;See All Releases&rdquo; button on homepage - <a href="https://github.com/ocaml/ocaml.org/pull/1740">ocaml/ocaml.org#1740</a></li>
<li><a href="https://github.com/RWUBAKWANAYO">@RWUBAKWANAYO</a> contributed: Resolve text styling issue in release list headers <a href="https://github.com/ocaml/ocaml.org/pull/1773">ocaml/ocaml.org#1773</a></li>
<li><a href="https://github.com/kevanantha">@kevanantha</a> contributed: Fix invalid link for exercises <a href="https://github.com/ocaml/ocaml.org/pull/1802">ocaml/ocaml.org#1802</a></li>
</ul></li>
<li>Other:
<ul class="org-ul">
<li><a href="https://github.com/oyenuga17">@oyenuga17</a> contributed: Replaced dependency `omd` with `cmarkit` - <a href="https://github.com/ocaml/ocaml.org/pull/1642">ocaml/ocaml.org#1642</a>. Thanks for this excellent and challenging contribution!</li>
<li>Remove Yoshi tool - <a href="https://github.com/ocaml/ocaml.org/pull/1735">ocaml/ocaml.org#1735</a></li>
<li>Removed dream-dashboard, it was replaced a self-hosted plausible.io instance - <a href="https://github.com/ocaml/ocaml.org/pull/1736">ocaml/ocaml.org#1736</a></li>
<li>Rename Tutorials-&gt;Documentation in meta title of Learn Area - <a href="https://github.com/ocaml/ocaml.org/pull/1789">ocaml/ocaml.org#1789</a></li>
</ul></li>
<li>Content:
<ul class="org-ul">
<li>Added &ldquo;Introduction to Functional Programming and the Structure of Programming Languages using OCaml&rdquo; to the books section - <a href="https://github.com/ocaml/ocaml.org/pull/1744">ocaml/ocaml.org#1744</a></li>
<li>Added the changelog for opam.2.2.0~alpha3 - <a href="https://github.com/ocaml/ocaml.org/pull/1771">ocaml/ocaml.org#1771</a></li>
<li>Update title of Platform Roadmap document to &rsquo;OCaml Platform Roadmap&rsquo; - <a href="https://github.com/ocaml/ocaml.org/pull/1790">ocaml/ocaml.org#1790</a></li>
<li>Add some feeds to the OCaml Planet - <a href="https://github.com/ocaml/ocaml.org/pull/1779">ocaml/ocaml.org#1779</a></li>
<li>Added &ldquo;Practical OCaml&rdquo; blog to the Planet - <a href="https://github.com/ocaml/ocaml.org/pull/1806">ocaml/ocaml.org#1806</a></li>
<li><a href="https://github.com/caisar-platform">@caisar-platform</a> contributed: Fix broken link in CEA Research Engineer offer. <a href="https://github.com/ocaml/ocaml.org/pull/1787">ocaml/ocaml.org#1787</a></li>
<li><a href="https://github.com/KihongHeo">@KihongHeo</a> contributed: Add KAIST as an academic institution <a href="https://github.com/ocaml/ocaml.org/pull/1791">ocaml/ocaml.org#1791</a></li>
<li><a href="https://github.com/hetzenmat">@hetzenmat</a> contributes: Fix wrong release date for 5.1.1 - <a href="https://github.com/ocaml/ocaml.org/pull/1858">ocaml/ocaml.org#1858</a></li>
<li><a href="https://github.com/zapashcanon">@zapashcanon</a> contributes: Fix order of presentations - <a href="https://github.com/ocaml/ocaml.org/pull/1859">ocaml/ocaml.org#1859</a></li>
<li><a href="https://github.com/oyenuga17">@oyenuga17</a> contributes: add outreachy blog | introduce yourself - <a href="https://github.com/ocaml/ocaml.org/pull/1848">ocaml/ocaml.org#1848</a></li>
<li><a href="https://github.com/IdaraNabuk">@IdaraNabuk</a> contributed: Add Outreachy Blog Post to OCaml Planet <a href="https://github.com/ocaml/ocaml.org/pull/1878">ocaml/ocaml.org#1878</a></li>
<li>Added &rsquo;Retrofitting Parallelism onto OCaml&rsquo; paper - <a href="https://github.com/ocaml/ocaml.org/pull/1875">ocaml/ocaml.org#1875</a></li>
</ul></li>
</ul>
</div>
</div>
</div>
</div>
