2024.01.23.txt

  *Most Important Changes TLDR*:
  • There’s now a self-hosted Plausible.io instance for OCaml.org,
    accessible at <https://plausible.ci.dev/ocaml.org>!
  • You can see the different OCaml teams (Compiler, Platform,
    Packaging, Infrastructure, OCaml.org) and the maintainers of
    relevant repositories at the new governance page at
    <https://ocaml.org/governance>!
  • The OCaml Logo now has a dedicated page at <https://ocaml.org/logo>!
  • We’re now displaying a package’s README on the package overview
    page.
  • You can now [list upcoming events] with date and time on
    <https://ocaml.org/community>.
  • OCaml.org now has social media images, so that sharing OCaml.org
    links looks nicer.

  Many thanks go out to the many contributors who helped improve
  OCaml.org in November and December. Find them listed below!

  *Relevant PRs and Activities:*
  • Features / Improvements:
    • Added a governance page that lists the maintainers and dev
      meetings of the compiler, all the projects of the OCaml Platform,
      and the ocaml.org infrastructure - [ocaml/ocaml.org#1239]
    • [@IdaraNabuk] contributed: Added the ability to record upcoming
      events to the community page - [ocaml/ocaml.org#1717]
    • [@Girish-Jangam] contributed: Added a page for the OCaml logo -
      [ocaml/ocaml.org#1711]
    • Add ability to disable an OCaml Planet source / fix scraper and
      scrape missing planet posts - [ocaml/ocaml.org#1734]
    • [@leostera] contributed: Package search UX improvements -
      [ocaml/ocaml.org#1691]
      • Added an OpenSearch manifest, so you can add the OCaml packages
        search to your browser search bar
      • Made search input in main navbar gain tab-focus earlier
      • Set tabindex=“1” for the in-package search input on the package
        documentation page
      • Autofocus the search inupt on the package search results page
    • [@mays4] contributed: Add links to CONTRIBUTING.md for all data
      items that can be contributed - [ocaml/ocaml.org#1682]
    • [@m-spitfire] contributed: Entries on the changelog page are now
      paginated - [ocaml/ocaml.org#1751]
    • Add missing social media images to OCaml.org HTML metadata. Now,
      posts shared on social media have the OCaml logo as image, which
      is much better than having no image - [ocaml/ocaml.org#1784]
    • We’re now displaying a package’s README on the package overview
      page. This was part of one of the design options from the package
      area redesign earlier this year. However, it wasn’t entirely clear
      that this was the right thing to do. More confirmation came up in
      terms of people asking for this, so we did it. -
      [ocaml/ocaml.org#1832]
    • Update to Tailwind CSS 3.3.6 - [ocaml/ocaml.org#1850]
    • Added table of contents to jump to individual sections on “Is
      OCaml Web yet” - [ocaml/ocaml.org#1849]
    • [@RWUBAKWANAYO] contributed: Improved responsive layout on
      releases page - [ocaml/ocaml.org#1716]
    • [@kiyov09] contributed: Reduced the number of news items in the
      blog page to have a similar height to the OCaml Planet column -
      [ocaml/ocaml.org#1754]
    • [@oyenuga17] contributed: Improved responsive collapsing of the
      table on the papers page - [ocaml/ocaml.org#1741]
  • Bugfixes:
    • Adjust CSS order of elements of main nav, starting from 0 -
      [ocaml/ocaml.org#1745]
    • Set correct background color on learn tabs select element -
      [ocaml/ocaml.org#1746]
    • [@Solar-Rays] contributed: Remove links from outreachy project
      description to prevent overflow - [ocaml/ocaml.org#1764]
    • Patch upstream dependency `river` to fall back to feed entry’s
      `id` if `links` tag does not exist. This allows more feeds to be
      scraped successfully. - [tarides/river#11]
    • Added missing Code of Conduct Route - [ocaml/ocaml.org#1781]
    • Added missing ’Platform Tools’ link in footer -
      [ocaml/ocaml.org#1788]
    • [@AndroGenius-codes] contributed: Fixed a bug in pagination where
      the page number “1” was displayed twice when all the results would
      fit on a single page - [ocaml/ocaml.org#1729]
    • [@Demmythetechie] contributed: Add `word-wrap: break-word` to the
      Tailwind Typography prose class to prevent long URLs in content
      areas from overflowing - [ocaml/ocaml.org#1722]
    • [@AndroGenius-codes] contributed: Shorten text on Outreachy
      Projects link on the community page to prevent overflow -
      [ocaml/ocaml.org#1749]
    • [@oyenuga17] contributed: Render search query as input value on
      the papers page and the releases page - [ocaml/ocaml.org#1747]
    • [@FatumaA] contributed: Added spacing below “See All Releases”
      button on homepage - [ocaml/ocaml.org#1740]
    • [@RWUBAKWANAYO] contributed: Resolve text styling issue in release
      list headers [ocaml/ocaml.org#1773]
    • [@kevanantha] contributed: Fix invalid link for exercises
      [ocaml/ocaml.org#1802]
  • Other:
    • [@oyenuga17] contributed: Replaced dependency `omd` with `cmarkit`
      - [ocaml/ocaml.org#1642]. Thanks for this excellent and
      challenging contribution!
    • Remove Yoshi tool - [ocaml/ocaml.org#1735]
    • Removed dream-dashboard, it was replaced a self-hosted
      plausible.io instance - [ocaml/ocaml.org#1736]
    • Rename Tutorials->Documentation in meta title of Learn Area -
      [ocaml/ocaml.org#1789]
  • Content:
    • Added “Introduction to Functional Programming and the Structure of
      Programming Languages using OCaml” to the books section -
      [ocaml/ocaml.org#1744]
    • Added the changelog for opam.2.2.0~alpha3 - [ocaml/ocaml.org#1771]
    • Update title of Platform Roadmap document to ’OCaml Platform
      Roadmap’ - [ocaml/ocaml.org#1790]
    • Add some feeds to the OCaml Planet - [ocaml/ocaml.org#1779]
    • Added “Practical OCaml” blog to the Planet -
      [ocaml/ocaml.org#1806]
    • [@caisar-platform] contributed: Fix broken link in CEA Research
      Engineer offer. [ocaml/ocaml.org#1787]
    • [@KihongHeo] contributed: Add KAIST as an academic institution
      [ocaml/ocaml.org#1791]
    • [@hetzenmat] contributes: Fix wrong release date for 5.1.1 -
      [ocaml/ocaml.org#1858]
    • [@zapashcanon] contributes: Fix order of presentations -
      [ocaml/ocaml.org#1859]
    • [@oyenuga17] contributes: add outreachy blog | introduce yourself
      - [ocaml/ocaml.org#1848]
    • [@IdaraNabuk] contributed: Add Outreachy Blog Post to OCaml Planet
      [ocaml/ocaml.org#1878]
    • Added ’Retrofitting Parallelism onto OCaml’ paper -
      [ocaml/ocaml.org#1875]


[list upcoming events]
<https://github.com/ocaml/ocaml.org/blob/main/CONTRIBUTING.md#content-upcoming_event>

[ocaml/ocaml.org#1239] <https://github.com/ocaml/ocaml.org/pull/1239>

[@IdaraNabuk] <https://github.com/IdaraNabuk>

[ocaml/ocaml.org#1717] <https://github.com/ocaml/ocaml.org/pull/1717>

[@Girish-Jangam] <https://github.com/Girish-Jangam>

[ocaml/ocaml.org#1711] <https://github.com/ocaml/ocaml.org/pull/1711>

[ocaml/ocaml.org#1734] <https://github.com/ocaml/ocaml.org/pull/1734>

[@leostera] <https://github.com/leostera>

[ocaml/ocaml.org#1691] <https://github.com/ocaml/ocaml.org/pull/1691>

[@mays4] <https://github.com/mays4>

[ocaml/ocaml.org#1682] <https://github.com/ocaml/ocaml.org/pull/1682>

[@m-spitfire] <https://github.com/m-spitfire>

[ocaml/ocaml.org#1751] <https://github.com/ocaml/ocaml.org/pull/1751>

[ocaml/ocaml.org#1784] <https://github.com/ocaml/ocaml.org/pull/1784>

[ocaml/ocaml.org#1832] <https://github.com/ocaml/ocaml.org/pull/1832>

[ocaml/ocaml.org#1850] <https://github.com/ocaml/ocaml.org/pull/1850>

[ocaml/ocaml.org#1849] <https://github.com/ocaml/ocaml.org/pull/1849>

[@RWUBAKWANAYO] <https://github.com/RWUBAKWANAYO>

[ocaml/ocaml.org#1716] <https://github.com/ocaml/ocaml.org/pull/1716>

[@kiyov09] <https://github.com/kiyov09>

[ocaml/ocaml.org#1754] <https://github.com/ocaml/ocaml.org/pull/1754>

[@oyenuga17] <https://github.com/oyenuga17>

[ocaml/ocaml.org#1741] <https://github.com/ocaml/ocaml.org/pull/1741>

[ocaml/ocaml.org#1745] <https://github.com/ocaml/ocaml.org/pull/1745>

[ocaml/ocaml.org#1746] <https://github.com/ocaml/ocaml.org/pull/1746>

[@Solar-Rays] <https://github.com/Solar-Rays>

[ocaml/ocaml.org#1764] <https://github.com/ocaml/ocaml.org/pull/1764>

[tarides/river#11] <https://github.com/tarides/river/pull/11>

[ocaml/ocaml.org#1781] <https://github.com/ocaml/ocaml.org/pull/1781>

[ocaml/ocaml.org#1788] <https://github.com/ocaml/ocaml.org/pull/1788>

[@AndroGenius-codes] <https://github.com/AndroGenius-codes>

[ocaml/ocaml.org#1729] <https://github.com/ocaml/ocaml.org/pull/1729>

[@Demmythetechie] <https://github.com/Demmythetechie>

[ocaml/ocaml.org#1722] <https://github.com/ocaml/ocaml.org/pull/1722>

[ocaml/ocaml.org#1749] <https://github.com/ocaml/ocaml.org/pull/1749>

[ocaml/ocaml.org#1747] <https://github.com/ocaml/ocaml.org/pull/1747>

[@FatumaA] <https://github/com/FatumaA>

[ocaml/ocaml.org#1740] <https://github.com/ocaml/ocaml.org/pull/1740>

[ocaml/ocaml.org#1773] <https://github.com/ocaml/ocaml.org/pull/1773>

[@kevanantha] <https://github.com/kevanantha>

[ocaml/ocaml.org#1802] <https://github.com/ocaml/ocaml.org/pull/1802>

[ocaml/ocaml.org#1642] <https://github.com/ocaml/ocaml.org/pull/1642>

[ocaml/ocaml.org#1735] <https://github.com/ocaml/ocaml.org/pull/1735>

[ocaml/ocaml.org#1736] <https://github.com/ocaml/ocaml.org/pull/1736>

[ocaml/ocaml.org#1789] <https://github.com/ocaml/ocaml.org/pull/1789>

[ocaml/ocaml.org#1744] <https://github.com/ocaml/ocaml.org/pull/1744>

[ocaml/ocaml.org#1771] <https://github.com/ocaml/ocaml.org/pull/1771>

[ocaml/ocaml.org#1790] <https://github.com/ocaml/ocaml.org/pull/1790>

[ocaml/ocaml.org#1779] <https://github.com/ocaml/ocaml.org/pull/1779>

[ocaml/ocaml.org#1806] <https://github.com/ocaml/ocaml.org/pull/1806>

[@caisar-platform] <https://github.com/caisar-platform>

[ocaml/ocaml.org#1787] <https://github.com/ocaml/ocaml.org/pull/1787>

[@KihongHeo] <https://github.com/KihongHeo>

[ocaml/ocaml.org#1791] <https://github.com/ocaml/ocaml.org/pull/1791>

[@hetzenmat] <https://github.com/hetzenmat>

[ocaml/ocaml.org#1858] <https://github.com/ocaml/ocaml.org/pull/1858>

[@zapashcanon] <https://github.com/zapashcanon>

[ocaml/ocaml.org#1859] <https://github.com/ocaml/ocaml.org/pull/1859>

[ocaml/ocaml.org#1848] <https://github.com/ocaml/ocaml.org/pull/1848>

[ocaml/ocaml.org#1878] <https://github.com/ocaml/ocaml.org/pull/1878>

[ocaml/ocaml.org#1875] <https://github.com/ocaml/ocaml.org/pull/1875>
