2024.01.23.org
* Discussions on the future of the opam repository
:PROPERTIES:
:CUSTOM_ID: 3
:END:
Archive: https://discuss.ocaml.org/t/discussions-on-the-future-of-the-opam-repository/13898/1

** Raphaël Proust announced


The [[https://github.com/ocaml/opam-repository/][default opam repository]] has been getting larger and larger with an
ever increasing number of packages. This is somewhat of a good sign for the active community of OCaml developers.
But it is also a challenge for its use, for its maintenance, and for the execution of its CI.

A discussion on the future of the opam repository is happening and we (the opam repository maintainers) would like
to invite OCaml developers at large to participate.

You can read the dedicated github issue [[https://github.com/ocaml/opam-repository/issues/23789][Requests for comments: how does opam-repository
scale?]] and share opinions there.

You can also join the public meeting held Wednesday 2024-01-24 at 14:00 GMT on
https://meet.jit.si/opam-repo-meeting.

Please do prefer the issue (rather than this thread) to discuss the issue (to keep the discussion in a central
location).
      



* dune 3.13
:PROPERTIES:
:CUSTOM_ID: 4
:END:
Archive: https://discuss.ocaml.org/t/ann-dune-3-13/13911/1

** Etienne Millon announced


We're happy to announce that Dune 3.13.0 is now available.
This feature is packed with fixes and new features that you can find in the changelog.

There are a few new features that we would like to specially highlight.

*** Generate Conflicts File for Menhir Grammars ([[https://github.com/ocaml/dune/pull/9512][#9512]], [[https://github.com/nojb][@nojb]])

When ~menhir~ is used to generate code from ~.mly~ files, there are sometimes issues with the grammar itself, such
as shift-reduce conflicts.

Menhir has an option to generate a "conflicts" file using its ~--explain~ flag, but until now this was not exposed
by Dune. Starting from this version, this file will be generated automatically to help developers debug their
grammars.

*** Cached Directory Targets ([[https://github.com/ocaml/dune/pull/9535][#9535]], [[https://github.com/rleshchinskiy][@rleshchinskiy]])

Dune's global cache is a way to save the result of intermediate build results, even across projects. Previously, it
would only work with file targets. With this change, it now supports Dune's experimental directory targets.

*** Dynamic Module List ([[https://github.com/ocaml/dune/pull/9578][#9578]], [[https://github.com/nojb][@nojb]])

In several places in the Dune language, it is possible to pass a list of modules. For example in a ~(library)~
stanza, if for some reason the default of picking all the source files in the current directory is not the right
thing to do, it is possible to pass ~(module A B C)~ to only attach these modules to the library.

An important limitation has been that the list of modules needed to be static: written as is in the ~dune~ file.
This limitation has now been lifted and it is possible to use ~(:include)~ or ~%{read-lines:file}~ in this field
and similar ones.

LexiFi's use case is a system of static plug-ins: a program is extended by selecting which modules are linked to
the application core. This list of modules can now be emitted by a generator that reads a configuration file.

Previously, this required using OCaml syntax for the ~dune~ file, which has several issues, including
incompatibility with features like ~(include_subdirs)~ and poor performance because Dune does not know the
dependencies of the generator and needs to re-run the build more times than necessary.

Here is the full changelog:

