2024.01.23.html
<div id="outline-container-3" class="outline-2">
<h2 id="3">Discussions on the future of the opam repository</h2>
<div class="outline-text-2" id="text-3">
<p>
Archive: <a href="https://discuss.ocaml.org/t/discussions-on-the-future-of-the-opam-repository/13898/1">https://discuss.ocaml.org/t/discussions-on-the-future-of-the-opam-repository/13898/1</a>
</p>
</div>
<div id="outline-container-org2f7f320" class="outline-3">
<h3 id="org2f7f320">Raphaël Proust announced</h3>
<div class="outline-text-3" id="text-org2f7f320">
<p>
The <a href="https://github.com/ocaml/opam-repository/">default opam repository</a> has been getting larger and larger with an
ever increasing number of packages. This is somewhat of a good sign for the active community of OCaml developers.
But it is also a challenge for its use, for its maintenance, and for the execution of its CI.
</p>

<p>
A discussion on the future of the opam repository is happening and we (the opam repository maintainers) would like
to invite OCaml developers at large to participate.
</p>

<p>
You can read the dedicated github issue <a href="https://github.com/ocaml/opam-repository/issues/23789">Requests for comments: how does opam-repository
scale?</a> and share opinions there.
</p>

<p>
You can also join the public meeting held Wednesday 2024-01-24 at 14:00 GMT on
<a href="https://meet.jit.si/opam-repo-meeting">https://meet.jit.si/opam-repo-meeting</a>.
</p>

<p>
Please do prefer the issue (rather than this thread) to discuss the issue (to keep the discussion in a central
location).
</p>
</div>
</div>
</div>
<div id="outline-container-4" class="outline-2">
<h2 id="4">dune 3.13</h2>
<div class="outline-text-2" id="text-4">
<p>
Archive: <a href="https://discuss.ocaml.org/t/ann-dune-3-13/13911/1">https://discuss.ocaml.org/t/ann-dune-3-13/13911/1</a>
</p>
</div>
<div id="outline-container-org1a94d18" class="outline-3">
<h3 id="org1a94d18">Etienne Millon announced</h3>
<div class="outline-text-3" id="text-org1a94d18">
<p>
We&rsquo;re happy to announce that Dune 3.13.0 is now available.
This feature is packed with fixes and new features that you can find in the changelog.
</p>

<p>
There are a few new features that we would like to specially highlight.
</p>
</div>
<div id="outline-container-orgb4decc4" class="outline-4">
<h4 id="orgb4decc4">Generate Conflicts File for Menhir Grammars (<a href="https://github.com/ocaml/dune/pull/9512">#9512</a>, <a href="https://github.com/nojb">@nojb</a>)</h4>
<div class="outline-text-4" id="text-orgb4decc4">
<p>
When <code>menhir</code> is used to generate code from <code>.mly</code> files, there are sometimes issues with the grammar itself, such
as shift-reduce conflicts.
</p>

<p>
Menhir has an option to generate a &ldquo;conflicts&rdquo; file using its <code>--explain</code> flag, but until now this was not exposed
by Dune. Starting from this version, this file will be generated automatically to help developers debug their
grammars.
</p>
</div>
</div>
<div id="outline-container-org90549a7" class="outline-4">
<h4 id="org90549a7">Cached Directory Targets (<a href="https://github.com/ocaml/dune/pull/9535">#9535</a>, <a href="https://github.com/rleshchinskiy">@rleshchinskiy</a>)</h4>
<div class="outline-text-4" id="text-org90549a7">
<p>
Dune&rsquo;s global cache is a way to save the result of intermediate build results, even across projects. Previously, it
would only work with file targets. With this change, it now supports Dune&rsquo;s experimental directory targets.
</p>
</div>
</div>
<div id="outline-container-org7e91799" class="outline-4">
<h4 id="org7e91799">Dynamic Module List (<a href="https://github.com/ocaml/dune/pull/9578">#9578</a>, <a href="https://github.com/nojb">@nojb</a>)</h4>
<div class="outline-text-4" id="text-org7e91799">
<p>
In several places in the Dune language, it is possible to pass a list of modules. For example in a <code>(library)</code>
stanza, if for some reason the default of picking all the source files in the current directory is not the right
thing to do, it is possible to pass <code>(module A B C)</code> to only attach these modules to the library.
</p>

<p>
An important limitation has been that the list of modules needed to be static: written as is in the <code>dune</code> file.
This limitation has now been lifted and it is possible to use <code>(:include)</code> or <code>%{read-lines:file}</code> in this field
and similar ones.
</p>

<p>
LexiFi&rsquo;s use case is a system of static plug-ins: a program is extended by selecting which modules are linked to
the application core. This list of modules can now be emitted by a generator that reads a configuration file.
</p>

<p>
Previously, this required using OCaml syntax for the <code>dune</code> file, which has several issues, including
incompatibility with features like <code>(include_subdirs)</code> and poor performance because Dune does not know the
dependencies of the generator and needs to re-run the build more times than necessary.
</p>

<p>
Here is the full changelog:
</p>
</div>
</div>
