2024.01.23.html
<div id="outline-container-orgc30d204" class="outline-4">
<h4 id="orgc30d204">Added</h4>
<div class="outline-text-4" id="text-orgc30d204">
<ul class="org-ul">
<li>Add command <code>dune cache clear</code> to completely delete all traces of the Dune
cache. (#8975, @nojb)</li>
<li>Allow to disable Coq 0.8 deprecation warning (#9439, @ejgallego)</li>
<li>Allow <code>OCAMLFIND_TOOLCHAIN</code> to be set per context in the workspace file
through the <code>env</code> stanza. (#9449, @rgrinberg)</li>
<li>Menhir: generate <code>.conflicts</code> file by default. Add new field to the
<code>(menhir)</code> stanza to control the generation of this file: <code>(explain &lt;blang
  expression&gt;)</code>. Introduce <code>(menhir (flags ...) (explain ...))</code> field in the
<code>(env)</code> stanza, delete <code>(menhir_flags)</code> field. All changes are guarded under
a new version of the Menhir extension, 3.0. (#9512, @nojb)</li>
<li>Directory targets can now be cached. (#9535, @rleshchinskiy)</li>
<li>It is now possible to use special forms such as <code>(:include)</code> and variables
<code>%{read-lines:}</code> in <code>(modules)</code> and similar fields. Note that the
dependencies introduced in this way (ie the files being read) must live in a
different directory than the stanza making use of them. (#9578, @nojb)</li>
<li>Remove warning 30 from default set for projects where dune lang is at least
3.13 (#9568, @gasche)</li>
<li>Add <code>coqdoc_flags</code> field to <code>coq</code> field of <code>env</code> stanza allowing the setting
of workspace-wide defaults for <code>coqdoc_flags</code>. (#9280, fixes #9139, @Alizter)</li>
<li>ctypes: fix an error where <code>(ctypes)</code> with no <code>(function_description)</code> would
cause an error trying refer to a nonexistent <code>_stubs.a</code> dependency (#9302,
fix #9300, @emillon)</li>
</ul>
</div>
</div>
<div id="outline-container-orgafb80f0" class="outline-4">
<h4 id="orgafb80f0">Changed</h4>
<div class="outline-text-4" id="text-orgafb80f0">
<ul class="org-ul">
<li>Check that package names in <code>(depends)</code> and related fields in <code>dune-project</code>
are well-formed. (#9472, fixes #9270, @ElectreAAS)</li>
</ul>
</div>
</div>
<div id="outline-container-orgcfa07e4" class="outline-4">
<h4 id="orgcfa07e4">Fixed</h4>
<div class="outline-text-4" id="text-orgcfa07e4">
<ul class="org-ul">
<li>Do not ignore <code>(formatting ..)</code> settings in context or workspace files
(#8447, @rgrinberg)</li>
<li>Fixed a bug where Dune was incorrectly parsing the output of coqdep when it
was escaped, as is the case on Windows. (#9231, fixes #9218, @Alizter)</li>
<li>Copying mode for sandboxes will now follow symbolic links (#9282, @rgrinberg)</li>
<li>Forbid the empty <code>(binaries ..)</code> field in the <code>env</code> stanza in the workspace
file unless language version is at least 3.2. (#9309, @rgrinberg)</li>
<li>[coq] Fix bug in computation of flags when composed with boot theories.
(#9347, fixes #7909, @ejgallego)</li>
<li>Fixed a bug where the <code>(select)</code> field of the <code>(libraries)</code> field of the
<code>(test)</code> stanza wasn&rsquo;t working properly. (#9387, fixes #9365, @Alizter)</li>
<li>Fix handling of the <code>PATH</code> argument to <code>dune init proj NAME PATH</code>. An
intermediate directory called <code>NAME</code> is no longer created if <code>PATH</code> is
supplied, so <code>dune init proj my_project .</code> will now initialize a project in
the current working directory. (#9447, fixes #9209, @shonfeder)</li>
<li>Experimental doc rules: Correctly handle the case when a package depends upon
its own sublibraries (#9461, fixes #9456, @jonludlam)</li>
<li>Resolve various public binaries to their build location, rather than to where
they&rsquo;re copied in the <code>_build/install</code> directory (#9496, fixes #7908,
@rgrinberg).</li>
<li>Correctly ignore warning flags in vendored projects (#9515, @rgrinberg)</li>
<li>Use watch exclusions in watch mode on MacOS (#9643, fixes #9517,
@PoorlyDefinedBehaviour)</li>
<li>Fix merlin configuration for <code>(include_subdirs qualified)</code> modules (#9659,
fixes #8297, @rgrinberg)</li>
<li>Fix handling of <code>enabled_if</code> in binary install stanzas. Previously, we&rsquo;d
ignore the result of <code>enabled_if</code> when evaluating <code>%{bin:..}</code> (#9707,
@rgrinberg)</li>
</ul>
</div>
</div>
</div>
</div>
<div id="outline-container-5" class="outline-2">
<h2 id="5">opam 2.2.0~beta1</h2>
<div class="outline-text-2" id="text-5">
<p>
Archive: <a href="https://discuss.ocaml.org/t/ann-opam-2-2-0-beta1/13913/1">https://discuss.ocaml.org/t/ann-opam-2-2-0-beta1/13913/1</a>
</p>
</div>
<div id="outline-container-org4b69b18" class="outline-3">
<h3 id="org4b69b18">Kate announced</h3>
<div class="outline-text-3" id="text-org4b69b18">
<p>
On behalf of the opam dev team, I’m happy to announce the first beta release of opam 2.2.0.
</p>
</div>
