2024.01.23.org
*** What’s new in this beta?

- ~opam init~ on Windows now requires you to choose which Git to use. Git for Windows is now recommended by default, though Cygwin's Git can of course still be used. See the blog post linked below for more info on why choose one over the other.
- when compiling opam on Windows with MinGW, the resulting opam binary now contains ~libstdc++~ instead of requiring the DLL to be distributed alongside it or to be present in the environment during compilation
- fix ~opam env~ containing carriage return on Cygwin - ~eval $(opam env)~ now works from a Cygwin bash terminal
- as well as a bunch of bug fixes and improvements

You’ll find these features presented in the [[https://opam.ocaml.org/blog/opam-2-2-0-beta1/][blog post]], and for
some extra details you can take a look at the [[https://github.com/ocaml/opam/releases/tag/2.2.0-beta1][release
note]] or the
[[https://github.com/ocaml/opam/blob/2.2.0-beta1/CHANGES][changelog]].

We encourage you to try out this beta release, instructions are detailed in the [[https://opam.ocaml.org/blog/opam-2-2-0-beta1][blog
post]], in particular [[https://opam.ocaml.org/blog/opam-2-2-0-beta1/#How-to-Test-opam-on-Windows][if you're using
Windows]] for which we provide a – /still
experimental/ – pre-built binary.

On Unix-like systems though, to upgrade, simply run:
#+begin_example
bash -c "sh <(curl -fsSL https://raw.githubusercontent.com/ocaml/opam/master/shell/install.sh) --version
2.2.0~beta1"
#+end_example

Happy hacking,
*<> <> The opam team <> <>* :camel:
      



* Zipc 0.1.0
:PROPERTIES:
:CUSTOM_ID: 6
:END:
Archive: https://discuss.ocaml.org/t/ann-zipc-0-1-0/13388/2

** Daniel Bünzli announced


Zipc 0.2.0 has been [[https://github.com/ocaml/opam-repository/pull/25105][released]] to the opam-repository.

It provides a few encoding bug fixes courtesy of Valentin Gatien-Baron's investigations on round tripping ~docx~
files with ~zipc~.

He also suggested not to ignore ~zip~'s declared metadata about decompression size to allow clients to easily cap
memory consumption for decoding untrusted zip files (breaking change).

The details are in the [[https://github.com/dbuenzli/zipc/blob/fa4bbfe4e70119665f39769bec9cfac9e0729304/CHANGES.md#v020-2024-01-22-la-forclaz-vs][release
notes]]
and many thanks to him.
      



* Other OCaml News
:PROPERTIES:
:CUSTOM_ID: 7
:END:
** From the ocaml.org blog


Here are links from many OCaml blogs aggregated at [[https://ocaml.org/blog/][the ocaml.org blog]].

- [[https://idaranabuk.com/blog/everyone_struggles][Outreachy Blog: Everyone Struggles]]
- [[https://idaranabuk.com/blog/ocaml_community][The OCaml Community]]
- [[https://tarides.com/blog/2024-01-17-what-are-data-races-and-do-they-threaten-your-business][What are Data Races? And do They Threaten Your Business?]]
- [[https://priver.dev/blog/functional-programming/concepts-of-functional-programming/][Concepts of Functional Programming]]
      



* Old CWN
:PROPERTIES:
:UNNUMBERED: t
:END:

If you happen to miss a CWN, you can [[mailto:alan.schmitt@polytechnique.org][send me a message]] and I'll mail it to you, or go take a look at [[https://alan.petitepomme.net/cwn/][the archive]] or the [[https://alan.petitepomme.net/cwn/cwn.rss][RSS feed of the archives]].

If you also wish to receive it every week by mail, you may subscribe to the [[https://sympa.inria.fr/sympa/info/caml-list][caml-list]].

#+BEGIN_authorname
[[https://alan.petitepomme.net/][Alan Schmitt]]
#+END_authorname
