2024.01.23.html
<div id="outline-container-org82242e6" class="outline-4">
<h4 id="org82242e6">What’s new in this beta?</h4>
<div class="outline-text-4" id="text-org82242e6">
<ul class="org-ul">
<li><code>opam init</code> on Windows now requires you to choose which Git to use. Git for Windows is now recommended by default, though Cygwin&rsquo;s Git can of course still be used. See the blog post linked below for more info on why choose one over the other.</li>
<li>when compiling opam on Windows with MinGW, the resulting opam binary now contains <code>libstdc++</code> instead of requiring the DLL to be distributed alongside it or to be present in the environment during compilation</li>
<li>fix <code>opam env</code> containing carriage return on Cygwin - <code>eval $(opam env)</code> now works from a Cygwin bash terminal</li>
<li>as well as a bunch of bug fixes and improvements</li>
</ul>

<p>
You’ll find these features presented in the <a href="https://opam.ocaml.org/blog/opam-2-2-0-beta1/">blog post</a>, and for
some extra details you can take a look at the <a href="https://github.com/ocaml/opam/releases/tag/2.2.0-beta1">release
note</a> or the
<a href="https://github.com/ocaml/opam/blob/2.2.0-beta1/CHANGES">changelog</a>.
</p>

<p>
We encourage you to try out this beta release, instructions are detailed in the <a href="https://opam.ocaml.org/blog/opam-2-2-0-beta1">blog
post</a>, in particular <a href="https://opam.ocaml.org/blog/opam-2-2-0-beta1/#How-to-Test-opam-on-Windows">if you&rsquo;re using
Windows</a> for which we provide a – <i>still
experimental</i> – pre-built binary.
</p>

<p>
On Unix-like systems though, to upgrade, simply run:
</p>
<pre class="example" id="org9f4c7a3">
bash -c "sh &lt;(curl -fsSL https://raw.githubusercontent.com/ocaml/opam/master/shell/install.sh) --version
2.2.0~beta1"
</pre>

<p>
Happy hacking,
<b>&lt;&gt; &lt;&gt; The opam team &lt;&gt; &lt;&gt;</b> :camel:
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-6" class="outline-2">
<h2 id="6">Zipc 0.1.0</h2>
<div class="outline-text-2" id="text-6">
<p>
Archive: <a href="https://discuss.ocaml.org/t/ann-zipc-0-1-0/13388/2">https://discuss.ocaml.org/t/ann-zipc-0-1-0/13388/2</a>
</p>
</div>
<div id="outline-container-org90e363e" class="outline-3">
<h3 id="org90e363e">Daniel Bünzli announced</h3>
<div class="outline-text-3" id="text-org90e363e">
<p>
Zipc 0.2.0 has been <a href="https://github.com/ocaml/opam-repository/pull/25105">released</a> to the opam-repository.
</p>

<p>
It provides a few encoding bug fixes courtesy of Valentin Gatien-Baron&rsquo;s investigations on round tripping <code>docx</code>
files with <code>zipc</code>.
</p>

<p>
He also suggested not to ignore <code>zip</code>&rsquo;s declared metadata about decompression size to allow clients to easily cap
memory consumption for decoding untrusted zip files (breaking change).
</p>

<p>
The details are in the <a href="https://github.com/dbuenzli/zipc/blob/fa4bbfe4e70119665f39769bec9cfac9e0729304/CHANGES.md#v020-2024-01-22-la-forclaz-vs">release
notes</a>
and many thanks to him.
</p>
</div>
</div>
</div>
<div id="outline-container-7" class="outline-2">
<h2 id="7">Other OCaml News</h2>
<div class="outline-text-2" id="text-7">
</div>
<div id="outline-container-orgb632d4b" class="outline-3">
<h3 id="orgb632d4b">From the ocaml.org blog</h3>
<div class="outline-text-3" id="text-orgb632d4b">
<p>
Here are links from many OCaml blogs aggregated at <a href="https://ocaml.org/blog/">the ocaml.org blog</a>.
</p>

<ul class="org-ul">
<li><a href="https://idaranabuk.com/blog/everyone_struggles">Outreachy Blog: Everyone Struggles</a></li>
<li><a href="https://idaranabuk.com/blog/ocaml_community">The OCaml Community</a></li>
<li><a href="https://tarides.com/blog/2024-01-17-what-are-data-races-and-do-they-threaten-your-business">What are Data Races? And do They Threaten Your Business?</a></li>
<li><a href="https://priver.dev/blog/functional-programming/concepts-of-functional-programming/">Concepts of Functional Programming</a></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgee89ca0" class="outline-2">
<h2 id="orgee89ca0">Old CWN</h2>
<div class="outline-text-2" id="text-orgee89ca0">
<p>
If you happen to miss a CWN, you can <a href="mailto:alan.schmitt@polytechnique.org">send me a message</a> and I&rsquo;ll mail it to you, or go take a look at <a href="https://alan.petitepomme.net/cwn/">the archive</a> or the <a href="https://alan.petitepomme.net/cwn/cwn.rss">RSS feed of the archives</a>.
</p>

<p>
If you also wish to receive it every week by mail, you may subscribe to the <a href="https://sympa.inria.fr/sympa/info/caml-list">caml-list</a>.
</p>

<div class="authorname" id="org782af8a">
<p>
<a href="https://alan.petitepomme.net/">Alan Schmitt</a>
</p>

</div>
</div>
</div>
</div>
</body>
</html>
