2024.01.23.txt


What’s new in this beta?
╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌

  • `opam init' on Windows now requires you to choose which Git to use.
    Git for Windows is now recommended by default, though Cygwin’s Git
    can of course still be used. See the blog post linked below for more
    info on why choose one over the other.
  • when compiling opam on Windows with MinGW, the resulting opam binary
    now contains `libstdc++' instead of requiring the DLL to be
    distributed alongside it or to be present in the environment during
    compilation
  • fix `opam env' containing carriage return on Cygwin - `eval $(opam
    env)' now works from a Cygwin bash terminal
  • as well as a bunch of bug fixes and improvements

  You’ll find these features presented in the [blog post], and for some
  extra details you can take a look at the [release note] or the
  [changelog].

  We encourage you to try out this beta release, instructions are
  detailed in the [blog post], in particular [if you’re using Windows]
  for which we provide a – /still experimental/ – pre-built binary.

  On Unix-like systems though, to upgrade, simply run:
  ┌────
  │ bash -c "sh <(curl -fsSL https://raw.githubusercontent.com/ocaml/opam/master/shell/install.sh) --version
  │ 2.2.0~beta1"
  └────

  Happy hacking, *<> <> The opam team <> <>* :camel:


[blog post] <https://opam.ocaml.org/blog/opam-2-2-0-beta1/>

[release note] <https://github.com/ocaml/opam/releases/tag/2.2.0-beta1>

[changelog] <https://github.com/ocaml/opam/blob/2.2.0-beta1/CHANGES>

[blog post] <https://opam.ocaml.org/blog/opam-2-2-0-beta1>

[if you’re using Windows]
<https://opam.ocaml.org/blog/opam-2-2-0-beta1/#How-to-Test-opam-on-Windows>


Zipc 0.1.0
══════════

  Archive: <https://discuss.ocaml.org/t/ann-zipc-0-1-0/13388/2>


Daniel Bünzli announced
───────────────────────

  Zipc 0.2.0 has been [released] to the opam-repository.

  It provides a few encoding bug fixes courtesy of Valentin
  Gatien-Baron’s investigations on round tripping `docx' files with
  `zipc'.

  He also suggested not to ignore `zip'’s declared metadata about
  decompression size to allow clients to easily cap memory consumption
  for decoding untrusted zip files (breaking change).

  The details are in the [release notes] and many thanks to him.


[released] <https://github.com/ocaml/opam-repository/pull/25105>

[release notes]
<https://github.com/dbuenzli/zipc/blob/fa4bbfe4e70119665f39769bec9cfac9e0729304/CHANGES.md#v020-2024-01-22-la-forclaz-vs>


Other OCaml News
════════════════

From the ocaml.org blog
───────────────────────

  Here are links from many OCaml blogs aggregated at [the ocaml.org
  blog].

  • [Outreachy Blog: Everyone Struggles]
  • [The OCaml Community]
  • [What are Data Races? And do They Threaten Your Business?]
  • [Concepts of Functional Programming]


[the ocaml.org blog] <https://ocaml.org/blog/>

[Outreachy Blog: Everyone Struggles]
<https://idaranabuk.com/blog/everyone_struggles>

[The OCaml Community] <https://idaranabuk.com/blog/ocaml_community>

[What are Data Races? And do They Threaten Your Business?]
<https://tarides.com/blog/2024-01-17-what-are-data-races-and-do-they-threaten-your-business>

[Concepts of Functional Programming]
<https://priver.dev/blog/functional-programming/concepts-of-functional-programming/>


Old CWN
═══════

  If you happen to miss a CWN, you can [send me a message] and I’ll mail
  it to you, or go take a look at [the archive] or the [RSS feed of the
  archives].

  If you also wish to receive it every week by mail, you may subscribe
  to the [caml-list].

  [Alan Schmitt]


[send me a message] <mailto:alan.schmitt@polytechnique.org>

[the archive] <https://alan.petitepomme.net/cwn/>

[RSS feed of the archives] <https://alan.petitepomme.net/cwn/cwn.rss>

[caml-list] <https://sympa.inria.fr/sympa/info/caml-list>

[Alan Schmitt] <https://alan.petitepomme.net/>
